[
  {
    "url": "https://weworkremotely.com/remote-jobs/uncanny-owl-wordpress-developer",
    "title": "WordPress Developer",
    "company": "Uncanny Owl",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3828/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> [Remote]\n    <br /><strong>URL:</strong> <a href=\"https://automatorplugin.com\">https://automatorplugin.com</a>\n</p>\n\n<p>As a WordPress Developer, you're responsible for Making Stuff Go. You'll build and maintain integrations that connect WordPress to hundreds of external services—from CRMs and email platforms to payment gateways and social networks. You'll own features from conception to completion, handling scoping, development, and testing.</p>\n<h3><strong>Day-to-day, you'll:</strong></h3>\n<ul>\n<li>Build new Automator integrations (triggers and actions) for third-party plugins and apps</li>\n<li>Scope, develop, and test product enhancements, new product features and product add-ons of all sizes</li>\n<li>Work with support to fix bugs reported by our internal team or by customers</li>\n<li>Refactor legacy code while maintaining backward compatibility</li>\n<li>Review pull requests from teammates and provide constructive feedback (GitHub PRs)</li>\n<li>Jump between front-end and back-end tasks as needed</li>\n<li>Communicate with the team and support your peers using chat, audio, and video</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<h3><strong>You Must Have</strong></h3>\n<p>These are actual requirements, not a wish list:</p>\n<ul>\n<li><strong>3+ years of WordPress plugin development</strong>&nbsp;— professional experience with plugin architecture and WordPress standards, not just plugin and theme tweaks</li>\n<li><strong>4+ years of Advanced PHP proficiency</strong>&nbsp;— OOP, autoloading, namespacing, traits, interfaces, modern PHP practices. You write classes, not 2000-line functions.php files</li>\n<li><strong>AI-assisted development expertise -&nbsp;</strong>you know how to leverage AI to amplify and accelerate your work - not replace your brain</li>\n<li><strong>Third-party API experience</strong>&nbsp;— consuming APIs from services like Stripe, Drip, Zapier, Google, MailChimp, etc.</li>\n<li><strong>WordPress hooks mastery</strong>&nbsp;— actions, filters, priorities. You know when to use each and why</li>\n<li><strong>Security awareness</strong>&nbsp;— escaping, sanitization, nonces, capability checks are second nature</li>\n<li><strong>Build tools</strong>&nbsp;— ability to use and extend webpack and similar tools</li>\n<li><strong>Package managers</strong>&nbsp;— familiarity with Composer and NPM</li>\n<li><strong>Git proficiency</strong>&nbsp;— competent with version control through git and GitHub. You've worked on a team codebase before</li>\n<li><strong>Keep it simple</strong>&nbsp;— ability to keep complex ideas and features simple (simplicity is a core value!)</li>\n<li><strong>Previous remote work experience</strong>&nbsp;— freelance or remote work background</li>\n<li><strong>Strong English communication</strong>&nbsp;— fluent in both verbal and written English. Remote work requires clear async communication, and there's no such thing as overcommunicating on our team</li>\n<li><strong>Personal Computer with Internet Access</strong></li>\n<li><strong>Availability</strong>&nbsp;— able to participate in audio/video meetings between 9 am - 5 pm EST</li>\n</ul>\n<h3><strong>Nice to Have</strong></h3>\n<p>These will make you stand out:</p>\n<ul>\n<li><strong>LearnDash experience</strong>&nbsp;— if you've built LearnDash add-ons or customizations, we want to talk</li>\n<li><strong>Existing Uncanny Automator integration</strong>&nbsp;— if you've worked to extend Uncanny Automator, we want to talk</li>\n<li><strong>Claude Code</strong>&nbsp;- you're an expert at giving Claude Code the guidance and context necessary to plan and execute a project, resulting in code that is equal in quality to what you could produce yourself, but created in a fraction of the time</li>\n<li><strong>HTML/CSS/SCSS experience</strong>&nbsp;— layout, specificity, cross-browser compatibility, accessibility</li>\n<li><strong>JavaScript expertise&nbsp;</strong>— vanilla JS, jQuery, ES6, DOM manipulation, async programming, closures, promises, web components, VueJS or React proficiency</li>\n<li><strong>MySQL expertise&nbsp;</strong>— database design, queries, optimization</li>\n<li><strong>REST API experience</strong>&nbsp;— working with WordPress REST API and authentication</li>\n<li><strong>TDD experience</strong>&nbsp;— writing PHP unit tests</li>\n<li><strong>UI/UX design chops</strong></li>\n<li><strong>DevOps or infrastructure management</strong></li>\n</ul>\n<h2><strong>Who Thrives Here</strong></h2>\n<ul>\n<li>You're a&nbsp;<strong>self-starter</strong>&nbsp;who loves taking initiative and seeing things through from conception to completion</li>\n<li>You're an&nbsp;<strong>excellent communicator</strong>&nbsp;who makes sure nothing slips through the cracks</li>\n<li>You have the&nbsp;<strong>curiosity and desire</strong>&nbsp;to learn and grow your skills</li>\n<li>You're&nbsp;<strong>passionate</strong>&nbsp;about leaving your mark on the web and excited to impact millions of users</li>\n<li>You take&nbsp;<strong>pride in quality and craftsmanship</strong>, not just checking boxes</li>\n<li>You're a&nbsp;<strong>team player</strong>&nbsp;who is comfortable working alongside and helping other developers, and you don't take critical feedback personally</li>\n<li>You're&nbsp;<strong>adaptable</strong>&nbsp;— happy working on tasks of all sizes</li>\n</ul>\n<h2><strong>What We Offer</strong></h2>\n<p>Working for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them.</p>\n<ul>\n<li><strong>Competitive salary</strong></li>\n<li><strong>Fully remote</strong>&nbsp;— work from anywhere. Our team spans Canada, Colombia, Philippines, Pakistan, Finland, and more</li>\n<li><strong>Annual all-company retreat</strong>&nbsp;— we fly everyone out once a year and cover all travel costs</li>\n<li><strong>Real ownership</strong>&nbsp;— you'll own features from scoping to deployment</li>\n<li><strong>Impact at scale</strong>&nbsp;— your code runs on tens of thousands of websites</li>\n<li><strong>Solve meaningful problems</strong>&nbsp;— your work makes a tangible difference</li>\n<li><strong>Work with the best</strong>&nbsp;— frequent, often daily, interactions with talented teammates</li>\n<li><strong>No politics, no b.s., and no jerks</strong></li>\n</ul>\n<h2><strong>Location &amp; Hours</strong></h2>\n<p>This is a remote position - our team is spread around the globe! Our home base is in Canada, so company operating hours are generally 9am - 5pm ET (UTC -5). While full coverage is not a requirement, you must be available during a portion of the day.</p>\n<h2><strong>How to Apply</strong></h2>\n<p><strong> Interested in applying?</strong></p>\n<p><strong> Please read and follow these steps carefully.&nbsp;</strong></p>\n<p><strong>Please clearly include the following in your cover letter:</strong></p>\n<ul>\n<li><strong>Your GitHub/GitLab/WordPress.org profile</strong>&nbsp;(required - include code samples)</li>\n<li><strong>Your experience with WordPress plugin development</strong>&nbsp;— tell us about a specific plugin you've built or contributed to</li>\n<li><strong>Your favorite WordPress hook/function and why</strong>&nbsp;— we want to see how you think about WordPress development</li>\n<li><strong>What AI coding tools you use</strong>&nbsp;and how they fit into your workflow</li>\n<li><strong>Tell us about yourself</strong>&nbsp;— why you should be considered, your experience, qualifications, personality, etc.</li>\n<li><strong>Other profile links</strong>&nbsp;if available (your website, Twitter, LinkedIn, etc.)</li>\n<li><strong>Answers to any additional interview questions</strong>&nbsp;in the application form</li>\n</ul>\n<p><strong>Important:</strong>&nbsp;Don't forget to proofread before submitting. Check spelling, capitalization, etc. Attention to detail is one of our core values - this is your chance to stand out!</p>\n<p><strong>Our process:</strong>&nbsp;Application review → Skills assessment → Code challenge → Live interview → Offer</p>\n<p>We won't be able to individually respond to all applications, but if we feel you're a strong match, someone will be in touch shortly.&nbsp;</p>\n<p>Thanks and we look forward to hearing from you!</p>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/uncanny-owl-wordpress-developer\">https://weworkremotely.com/remote-jobs/uncanny-owl-wordpress-developer</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/zipdev-senior-web-developer",
    "title": "Senior Web Developer",
    "company": "Zipdev",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3825/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Colombia\n    <br /><strong>URL:</strong> <a href=\"http://zipdev.com\">http://zipdev.com</a>\n</p>\n\n<strong>Description</strong><br><p>We are looking for an experienced <strong>Senior Web Developer</strong> to own the development of high-quality, performant, and conversion-focused marketing websites. This role is highly hands-on and ideal for someone who thrives in technical problem-solving, cross-functional collaboration, and modern web development best practices. You'll work closely with design, product, marketing, and data teams to deliver fast, accessible, SEO-optimized experiences while contributing to technical standards and mentoring junior developers.</p><p></p><h3><strong>Key Responsibilities</strong></h3><h3><strong>Development &amp; Implementation</strong></h3><ul><li> Build responsive, accessible, high-performance marketing websites using modern frameworks. </li><li> Develop and maintain reusable component libraries tied to design systems. </li><li> Implement SSR/SSG strategies to improve performance and SEO. </li><li> Integrate headless CMS platforms with scalable, component-based architectures. </li><li> Write clean, testable, well-documented code following best practices. </li><li> Debug and resolve production issues and participate in incident response. </li></ul><h3><strong>Performance &amp; Quality</strong></h3><ul><li> Optimize sites for Core Web Vitals and overall performance. </li><li> Implement analytics, tracking, A/B testing, and personalization features. </li><li> Ensure accessibility compliance (WCAG 2.2 AA) and cross-browser/device compatibility. </li><li> Maintain unit, integration, and end-to-end tests. </li><li> Support CRO and experimentation initiatives. </li></ul><h3><strong>Technical Collaboration</strong></h3><ul><li> Participate in code reviews and mentor junior developers. </li><li> Work closely with UX/UI designers to ensure accurate implementation. </li><li> Partner with marketing teams to implement technical SEO requirements. </li><li> Coordinate with analytics teams on tracking and instrumentation. </li><li> Contribute to documentation, coding standards, and architectural decisions.</li></ul><br><br><strong>Requirements</strong><br><ul><li>5+ years of professional web development experience. </li><li> Strong JavaScript/TypeScript skills and experience with React, Next.js, or Astro. </li><li> Advanced CSS and layout skills, ideally with Tailwind CSS. </li><li> Experience with SSR, SSG, and hybrid rendering models. </li><li> Hands-on experience with headless CMS platforms (Contentful, Sanity, Strapi, etc.). </li><li> Solid understanding of technical SEO and Core Web Vitals. </li><li> Experience with GA4, GTM, and analytics integrations. </li><li> Proficiency with Git, CI/CD workflows, and modern hosting platforms (Vercel, Netlify, Cloudflare). </li><li> Familiarity with testing tools such as Vitest, Playwright, or Cypress. </li><li> Strong communication and cross-team collaboration abilities. </li><li>Must be located in Latam. </li></ul><h3><strong>Nice-to-have</strong></h3><ul><li> Experience developing complex, content-heavy marketing or listing sites. </li><li> Working with design systems and tooling like Storybook. </li><li> Knowledge of CDN, caching, and edge computing strategies. </li><li> Experience with experimentation platforms and A/B testing tools. </li><li> Understanding of web security best practices. </li><li> Exposure to AI-assisted development tooling. </li></ul><br><br><strong>Benefits</strong><br><ul> <li>Work remotely Monday - Friday, 40 hours a week (no weekends)</li> <li>Vacation: 10 business days a year</li> <li>Holidays: 5 National Holidays a year</li> <li>Company Holidays: 5 Company Holidays a year (Christmas Eve, Christmas Day, New Year's Eve, New Year's Day, Zipdev Day)</li> <li>Parental Leave</li> <li>Health Care Reimbursement</li> <li>Active Lifestyle Reimbursement</li> <li>Quarterly Home Office Reimbursement</li> <li>Payroll Deduction Purchase Plans</li> <li>Longevity Bonus</li> <li>Continuous Learning Bonus</li> <li>Access to Training and Professional Development Platforms</li> <li>Did we mention it's REMOTE?!!</li> </ul><p></p><p>One of our core values at Zipdev is \"Be authentic.\" that's why we encourage you to answer the application form in your own words; we are interested in getting to know you, not a digital assistant.<br></p><p>Wondering how our remote environment or our payment method work? We've put together some helpful answers in our FAQs at the bottom our our <a class=\"external\" href=\"https://zipdev.com/careers/%20\">career site. </a> Take a look and let us know if you have any other questions!</p>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/zipdev-senior-web-developer\">https://weworkremotely.com/remote-jobs/zipdev-senior-web-developer</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/linkage-web-development-asp-net-developer-c-mvc-sql-server-javascript",
    "title": "ASP.NET Developer (C#, MVC, SQL Server, JavaScript)",
    "company": "Linkage Web Development",
    "location": "Pampanga",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> [REMOTE]\n    <br /><strong>URL:</strong> <a href=\"http://linkage.ph\">http://linkage.ph</a>\n</p>\n\n<div class=\"single-job-form\">\n<p><strong>Job Title:&nbsp; </strong>ASP.NET Developer (C#, MVC, SQL Server, JavaScript) | Remote – Philippines</p>\n<p><strong>Company:</strong> Linkage Web Development Solutions</p>\n<p><strong>Employment Type: </strong>Full-Time | Long-Term</p>\n<p><strong>Location: </strong>100% Remote – Philippines</p>\n<p><strong>Salary Range: </strong>₱50,000 – ₱80,000/month (depending on experience and skill level)</p>\n<p><strong>About the Role</strong></p>\n<p>At Linkage Web Development Solutions, we’re hiring an <strong>ASP.NET Developer</strong> who values mastery, autonomy, and purpose in their work.</p>\n<p>You’ll help maintain and improve classic ASP.NET WebForms and MVC applications built for U.S.-based businesses systems that power real operations and deserve thoughtful care.</p>\n<p>This role is perfect for developers who take pride in making things stable, efficient, and a little better every week.</p>\n<p>Whether you’re an up-and-coming developer looking to learn from seasoned engineers or an experienced freelancer ready for steady, long-term work, we’ve built space for your growth here.</p>\n<p><strong>What You’ll Do</strong></p>\n<ul>\n<li>\n<p>Maintain and update ASP.NET applications (WebForms, MVC, VB.NET, C#).</p>\n</li>\n<li>\n<p>Manage and optimize SQL Server and MySQL databases.</p>\n</li>\n<li>\n<p>Debug, troubleshoot, and document improvements.</p>\n</li>\n<li>\n<p>Collaborate with project managers and QA for smooth deployments.</p>\n</li>\n<li>\n<p>Contribute ideas to improve system performance and reliability.</p>\n</li>\n<li>\n<p>Participate in mentorship and shared learning sessions within the dev team.</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Who We’re Looking For</strong></p>\n<p><strong>For Junior Developers (₱50K–₱70K/month):</strong></p>\n<ul>\n<li>\n<p>1–3 years of hands-on experience in ASP.NET (MVC or WebForms).</p>\n</li>\n<li>\n<p>Familiarity with C#, SQL Server, and basic JavaScript/jQuery.</p>\n</li>\n<li>\n<p>Eager to learn, adaptable, and detail-oriented.</p>\n</li>\n<li>\n<p>Excited to work with senior mentors on real production systems.</p>\n</li>\n</ul>\n<p><strong>For Experienced Developers / Freelancers (₱70K–₱80K/month):</strong></p>\n<ul>\n<li>\n<p>3+ years of experience maintaining or developing ASP.NET applications.</p>\n</li>\n<li>\n<p>Proficiency in C#, VB.NET, SQL Server, MySQL, and JavaScript/jQuery/AJAX.</p>\n</li>\n<li>\n<p>Self-directed and dependable, with experience working remotely or with international clients.</p>\n</li>\n<li>\n<p>Strong communication and documentation skills.</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Perks &amp; Benefits</strong></p>\n<ul>\n<li>\n<p>Competitive Pay: ₱50K–₱80K/month depending on level and contribution.</p>\n</li>\n<li>\n<p>100% Remote: Work from anywhere in the Philippines.</p>\n</li>\n<li>\n<p>Career Growth: Hands-on mentorship and exposure to U.S. projects.</p>\n</li>\n<li>\n<p>Long-Term Stability: Consistent workload, no short-term contracts.</p>\n</li>\n<li>\n<p>Collaborative Team Culture: Clarity, respect, and shared learning.</p>\n</li>\n<li>\n<p>Organized Systems: We work smart, not chaotic.</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Why Join Linkage Web Development Solutions</strong></p>\n<p>We’re a Philippine-based development company supporting U.S. organizations through clean, sustainable engineering.</p>\n<p>Our people don’t just write code,&nbsp;they improve systems, simplify processes, and share what they learn.</p>\n<p>Here, you’ll be treated as a professional, not a replaceable part. Your growth compounds as the systems you build improve.</p>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/linkage-web-development-asp-net-developer-c-mvc-sql-server-javascript\">https://weworkremotely.com/remote-jobs/linkage-web-development-asp-net-developer-c-mvc-sql-server-javascript</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-qa-engineer-m-w-d",
    "title": "QA Engineer (M/W/D)",
    "company": "Anexia Internetdienstleistungs",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> \n    <br /><strong>URL:</strong> <a href=\"http://anexia.com\">http://anexia.com</a>\n</p>\n\n<div>Wir bei Anexia übernehmen jeden Tag Verantwortung für alle <b>Herausforderungen der digitalen Welt.</b> Denn wir verstehen uns als die <b>„Digital Transformation Engine“. </b>Wie uns das gelingt? Ganz einfach. Wir sind eine Familie von Möglichmacher:innen und Neu-Denker:innen. Wir können, wir wollen und wir dürfen auch. Und das macht uns einzigartig! Willst Du ein Teil unserer digitalen Revolution werden und mit uns gemeinsam Geschichte schreiben? <b>#joinourrevolution</b>\n<h1>QA ENGINEER (M/W/D)</h1>\n<p>Wien,&nbsp;Graz,&nbsp;Klagenfurt,&nbsp;Karlsruhe,&nbsp;Remote&nbsp;|&nbsp;Teilzeit (20 - 30 Stunden)</p>\n<p>Du hast ein Auge für Details und tüftelst gerne daran, Systeme auf Herz und Nieren zu prüfen? Qualität ist für dich kein Schlagwort, sondern ein Anspruch, den du mit durchdachten Tests und cleveren Methoden lebst? Dann bring dein Know-how ein und gestalte mit uns die Zukunft unseres Virtualisierungs-Stacks bei Anexia!</p>\n<h2>#Profile</h2>\n                    &nbsp;\n                    <ul>\n<li>\n<p>Integration in ein agiles Softwareentwicklungs-Team</p>\n</li>\n</ul>\n<ul>\n<li>\n<p>End to End Testing unseres Virtualisierungs-Stacks</p>\n</li>\n<li>\n<p>Ausbau von Testmethoden sowie Einsatz von Test- und QA-Tools</p>\n</li>\n<li>\n<p>Erstellung und Pflege von Testplänen</p>\n</li>\n<li>\n<p>Unterstützung beim Ausbau des Monitorings</p>\n</li>\n</ul>\n<h2>#Wanted</h2>\n                    &nbsp;\n                    <ul>\n<li>\n<p>Abgeschlossenes Bachelor-Studium in Computer Science, IT, Softwareentwicklung oder vergleichbare Qualifikation</p>\n</li>\n<li>\n<p>Mindestens drei Jahre Berufserfahrung im Testen von Systemen mit mehreren Komponenten</p>\n</li>\n<li>\n<p>Erfahrung im Umgang mit Test- und Monitoringtools</p>\n</li>\n<li>Erfahrung in der Softwareentwicklung sowie im Bereich Virtualisierung wünschenswert, jedoch nicht zwingend erforderlich&nbsp;</li>\n<li>\n<p>Analytisches und lösungsorientiertes Denken sowie selbstständige Arbeitsweise</p>\n</li>\n<li>\n<p>Sehr gute Deutsch- und Englischkenntnisse</p>\n</li>\n</ul>\n<h2>#REWARD</h2>\n            Anexia wurde als Familie groß und das soll auch in unserer Wachstumsstrategie so bleiben. Wir übernehmen gerne Verantwortung, respektieren einander und wir wissen, dass wir alles schaffen können. Wir schauen gut auf Anexia und Anexia schaut auch gut auf uns. Begeisterung, Erfahrung und Kompetenz zählen, daher kannst Du ein faires Gehalt und zahlreiche Benefits erwarten.<br>\n<h4>Gehaltsspanne</h4>\n<p>mind. 50.000€</p>\n<h4>Unsere Benefits</h4>\n                &nbsp;\n            Wir sind mehr als ein Arbeitsplatz. Daher bieten wir unseren Mitarbeiter:innen (teils abhängig von Deiner Position und Deinem Standort) viele Benefits: Gute Verkehrsanbindung, flexible Arbeitszeiten, Aus- und Weiterbildung, Mentoren-Programm, kostenlose Parkplätze, Arbeitshandy- und -notebook, Snacks und Getränke, Firmenwagen, Mitarbeiter:innen-Events, Fun-Corner, u.v.m.\n                #JOINOURREVOLUTION\n                <h2>#About</h2>\n            Anexia bietet hochwertige und individuelle Lösungen im Bereich Web- und Managed Hosting, sowie Individualsoftware- und App Entwicklung. Das 2006 gegründete Unternehmen mit Sitz in Klagenfurt und weiteren Standorten in Wien, Graz, Karlsruhe, Nürnberg und New York betreut zahlreiche internationale Kunden.\n                Über 350 Mitarbeiter:innen an mehr als 5 Bürostandorten in Österreich, Deutschland und den USA\n                Wir sind ISO-zertifiziert und haben seit Jahren eine „Sehr gute Bonität“.\n                Auf diese Qualität vertrauen Kunden wie Lufthansa, McDonalds, TeamViewer, u.v.m.\n                Über 350 Mitarbeiter:innen an mehr als 5 Bürostandorten in Österreich, Deutschland und den USA\n                Wir sind ISO-zertifiziert und haben seit Jahren eine „Sehr gute Bonität“.\n                Auf diese Qualität vertrauen Kunden wie Lufthansa, McDonalds, TeamViewer, u.v.m.\n                \n<h3>Du hast noch Fragen?</h3> \nMarina MAROS &nbsp;|&nbsp; Telefon: +43-50-556 &nbsp;|&nbsp; E-mail: career@anexia-it.com</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-qa-engineer-m-w-d\">https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-qa-engineer-m-w-d</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/speechify-inc-software-engineer-ios-core-product",
    "title": "Software Engineer, iOS Core Product",
    "company": "Speechify Inc",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Florida\n    <br /><strong>URL:</strong> <a href=\"http://www.speechify.com\">http://www.speechify.com</a>\n</p>\n\n<p><strong>Overview</strong></p>\n<p>With the growth of our iOS app, being the #18 productivity app in the App Store category and also our recent recognition as Apple's 2025 Design Award for inclusivity, we find the need for a Senior iOS Engineer to help us support the new user base as well as work on new and exciting projects to push our missing forward. &nbsp;&nbsp;</p>\n<p>This is a key role and ideal for someone who thinks strategically, enjoys fast-paced environments, passionate about making product decisions, and has experience building great user experiences that delight users.</p>\n<p>We are a flat organization that allows anyone to become a leader by showing excellent technical skills and delivering results consistently and fast. Work ethic, solid communication skills, and obsession with winning are paramount.&nbsp;</p>\n<p>Our interview process involves several technical interviews and we aim to complete them within 1 week.&nbsp;</p>\n<p><strong>What Yo</strong><strong>u’</strong><strong>ll Do</strong></p>\n<ul>\n<li>Opportunity to lead key engineering and product decisions</li>\n<li>Actively shipping production code for the Speechify iOS app</li>\n<li>Work within a dedicated product team</li>\n<li>Participate in product discussions to shape the product roadmap</li>\n<li>Maintain and enhance the existing complex app architecture</li>\n</ul>\n<p><strong>An Ideal Candidate Should Have</strong></p>\n<ul>\n<li>Experience. You've worked on products that scaled to a large user base</li>\n<li>Track record. You have worked on various products from inception to decent traction. You have been responsible for engineering the product</li>\n<li>Customer obsession. We expect every team member whose responsibilities directly impact customers to be constantly obsessed about providing the best possible experience</li>\n<li>Product thinking. You make thoughtful decisions about the evolution of your product and support internal teams and designers into taking the right direction</li>\n<li>Speed. You work quickly to generate ideas and know how to decide which things can ship now and what things need time</li>\n<li>Focus. We’re a high-growth startup with a busy, remote team. You know how and when to engage or be heads down</li>\n<li>Technical skills. Swift, SwiftUI</li>\n</ul>\n<p><strong>Technical Requirements:</strong></p>\n<ul>\n<li>Swift Programming Language</li>\n<li>SwiftUI experience</li>\n<li>Experience in Multithreading Programming</li>\n<li>Working with CI/CD infrastructure</li>\n<li>Experience with Fastlane</li>\n<li>SOLID principles, the ability to write every single class according to SOLID</li>\n<li>Experience with Git and understanding of different Git strategies</li>\n</ul>\n<p><strong>What We offer:</strong></p>\n<ul>\n<li>A fast-growing environment where you can help shape the company and product</li>\n<li>An entrepreneurial crew that supports risk, intuition, and hustle</li>\n<li>The opportunity to make a big impact in a transformative industry</li>\n<li>A competitive salary, a collegiate atmosphere, and a commitment to building a great asynchronous culture</li>\n<li>Work on a product that millions of people use and where daily feedback includes users sharing that they cried when they first found the product because it was so impactful on their lives</li>\n<li>Support people with learning differences like Dyslexia, ADD, Low Vision, Concussions, Autism, and Second Language Learners, and give reading superpowers to professionals all over the world</li>\n<li>Work in one of the fastest growing sectors of tech: Intersection of Artificial Intelligence and Audio</li>\n</ul>\n<p><strong>Think you’re a good fit for this job?&nbsp;</strong></p>\n<p>Tell us more about yourself and why you're interested in the role when you apply.<br>And don’t forget to include links to your portfolio and LinkedIn.</p>\n<p><strong>Not looking but know someone who would make a great fit?&nbsp;</strong></p>\n<p>Refer them!&nbsp;</p>\n<p><strong>Speechify is committed to a diverse and inclusive workplace.&nbsp;</strong></p>\n<p>Speechify does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.</p>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/speechify-inc-software-engineer-ios-core-product\">https://weworkremotely.com/remote-jobs/speechify-inc-software-engineer-ios-core-product</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/rapid-strategy-senior-penetration-tester-webapp-and-network",
    "title": "Senior Penetration Tester (WebApp and Network)",
    "company": "Rapid Strategy",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3784/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> This is a remote role\n    <br /><strong>URL:</strong> <a href=\"http://rapidstrategy.io\">http://rapidstrategy.io</a>\n</p>\n\n<div class=\"col-md-7 job-content min_height_300 vega-col-6\">\n<div class=\"margin_bottom_20\">\n<p>Rapid Strategy is seeking a Mid to Senior Level Penetration Test Consultants for both web apps and network. Rapid Strategy is an award-winning and&nbsp; African-American owned small business providing cybersecurity services to the private and public sector. Based in Charlotte, NC, we support our clients across the North Carolina and DMV area. You can learn more about Rapid Strategy at&nbsp;<a href=\"http://www.rapidstrategy.io/\">www.RapidStrategy.io</a></p> <p>&nbsp;The primary objective of the Penetration Tester is to simulate cyber attacks on web applications to identify security vulnerabilities before they can be exploited by malicious actors. This role involves a combination of analytical skills, technical expertise, and creativity to simulate real-world hacking scenarios.&nbsp;&nbsp;</p> <p></p> <p><b>&nbsp;<span>Key Responsibilities:</span></b></p> <ul><li>Conducting thorough penetration tests on web applications to identify vulnerabilities.</li><li>Utilizing various penetration testing tools and methodologies to simulate cyber attacks.</li><li>Analyzing web applications for weaknesses and vulnerabilities using manual and automated methods.</li><li>Understanding and exploiting known web vulnerabilities such as SQL injection, Cross-Site Scripting (XSS), Cross-Site Request Forgery (CSRF), and others.</li><li>Preparing detailed reports on findings and providing recommendations for security improvements.</li><li>Collaborating with development teams to advise on security best practices.</li><li>Keeping abreast of the latest cybersecurity threats and testing methodologies.</li></ul> <p>&nbsp;<span>Required Skills and Qualifications:</span></p> <ul><li>Bachelor’s degree in Computer Science, Information Security, or related field, OR equivalent experience also accepted.</li><li>5-8 years of experience</li><li>Industry certifications such as Certified Ethical Hacker (CEH), Offensive Security Certified Professional (OSCP), or GIAC Web Application Penetration Tester (GWAPT).</li><li>Strong understanding of web application technologies and protocols (HTTP/HTTPS, HTML, JavaScript, etc.).</li><li>Proficiency tools like Tennable, Burp Suite, NMap, OWASP ZAP, Metasploit, SQLMap, etc.</li><li>Experience with known exploits and their mitigation.</li><li>Ability to analyze and report on penetration testing outcomes effectively.</li><li>Excellent problem-solving and analytical skills.</li><li>Strong communication skills for collaboration with cross-functional teams.</li></ul> <p>&nbsp;<span>Desirable Skills:</span></p> <ul><li>Experience with programming/scripting languages such as Python, JavaScript, and Ruby.</li><li>Expert knowledge of network security and operating systems.</li><li>Familiarity with cloud environments and container technologies</li></ul> <p><span>This role will be primarily remote but may require travel.&nbsp;</span></p> <p></p> <p><b>&nbsp;<span>Please note that this position requires applicants to be U.S. citizens and based in the United States. Only individuals who meet these criteria will be considered for employment. </span></b></p> </div>\n<div class=\"border_top eee font_12 padding_10 padding_left_0 padding_right_0\">\n<a class=\"vega-default-link\" href=\"https://rapidstrategy.easyapply.co\"><i class=\"icon-briefcase\"></i><span class=\"padding_left_5\">View all jobs at this company</span></a>\n\n</div>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/rapid-strategy-senior-penetration-tester-webapp-and-network\">https://weworkremotely.com/remote-jobs/rapid-strategy-senior-penetration-tester-webapp-and-network</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/wevote-fundraiser-volunteer-ambassador",
    "title": "Fundraiser, Volunteer Ambassador",
    "company": "WeVote",
    "location": "California",
    "salary_raw": "$50K",
    "description": "<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"http://wevote.us\">http://wevote.us</a>\n</p>\n\n<div class=\"col col-xs-7 description\">\n<p><strong>* Fraud and phishing warning *&nbsp;</strong></p><p><b><i>Please apply directly via our volunteering portal/ATS at&nbsp;https://wevote.applytojob.com/apply. Do not apply via any other job portals, aggregators, or sites, as your information may not be secure, or the role may no longer be accepting applications. Thank you</i></b><br><br><i>*About WeVote*<br>WeVote is a 100% volunteer-powered, nonpartisan nonprofit that uses technology to help voters make informed decisions. With 130+ active volunteers and a national reach—all on a budget under $50K/year—we prove grassroots, mission-first civic tech can have real impact.</i><br><br><strong>Join the WeVote Movement</strong></p><p>WeVote has an open volunteer position for a <strong>Fundraiser, Volunteer Ambassador, for 5 hours or more per week.</strong> You are an experienced professional with a passion for helping America navigate our current political environment. This is an opportunity to work remotely with our active team to help us get ready for multiple upcoming elections. Our ideal volunteer is passionate about politics and excited to use technology to educate voters and increase voter turnout.&nbsp;You’ll also gain valuable technical skills, have opportunities for leadership development, and expand your personal and professional network.</p><p><strong>About Us</strong></p><p>WeVote is a nonpartisan get-out-the-vote nonprofit startup and a celebrated <a href=\"https://www.ffwd.org/about\">Fast Forward nonprofit technology grantee</a>. WeVote is a movement of over 120 active passionate, part-time volunteers (starting with the founders) who build mobile technologies that will touch and mobilize millions of voters on Election Day. We believe that many voters are busy, distracted, and impatient. We have a goal of providing a positive voting experience that helps people decide how to vote. More information at <a href=\"https://wevote.us/?utm_source=jazzhr&amp;utm_medium=referral&amp;utm_campaign=job_ad&amp;utm_id=jazzhrjobad\">https://WeVote.US</a> or @WeVote on X.</p><p><strong>What You'll Do</strong></p><ul><li>Recruit, motivate, and support volunteers who serve as fundraising ambassadors for our organization.</li><li>Create toolkits, templates, and digital resources volunteers can use to share donation asks across email, social media, and personal networks.</li><li>Coach and inspire volunteers to confidently make fundraising appeals and tell our story in authentic, mission-centered ways.</li><li>Coordinate small peer-to-peer fundraising campaigns and community challenges.</li><li>Collaborate with the Recruitment team to ensure consistent messaging and branding.</li><li>Recognize and celebrate volunteer fundraising milestones and donor engagement wins.</li><li>Track outreach, participation, and fundraising progress using CRM tools.</li><li>Provide feedback and insights to improve future volunteer fundraising programs.</li></ul><p><strong>Who you are: Must haves.</strong></p><ul><li>You want to work with an established and successful team. You are committed to strengthening American Democracy.</li><li>You are striving for personal excellence, and want to do meaningful work that will make a difference.</li><li>1–2 years of experience in fundraising, volunteer coordination, or community engagement (nonprofit experience preferred).</li><li>Strong interpersonal and communication skills — comfortable connecting with diverse audiences.</li><li>Excellent communication and storytelling ability, with comfort presenting or training small groups.</li><li>Organized, detail-oriented, and proactive in follow-u</li><li>Energetic, organized, and motivated by mission-driven work.</li><li>A willingness to work with and support other volunteers.</li><li>Familiarity with CRM, email marketing, or fundraising tools a plus.</li><li>5+ hours per week during our core team hours M-F 8 a.m. - 6 p.m. PT</li></ul><p><strong>How to apply:</strong></p><p>Submit your resume (at&nbsp;https://wevote.applytojob.com/apply/) and include a brief note/cover letter to why you are interested in WeVote and helping our mission.</p> </div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/wevote-fundraiser-volunteer-ambassador\">https://weworkremotely.com/remote-jobs/wevote-fundraiser-volunteer-ambassador</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": {
      "min": 50000,
      "max": 50000
    },
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-senior-php-developer-3",
    "title": "Senior PHP Developer",
    "company": "OnTheGoSystems",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"http://onthegosystems.com\">http://onthegosystems.com</a>\n</p>\n\n<p>Help us build and support&nbsp;<a href=\"https://wpml.org/\">WPML</a> – the leading multilingual plugin powering 1.5M+ websites.</p>\n<p>We’re looking for smart, curious developers who enjoy solving real problems and want to grow fast. This role mixes development and support: you learn the product deeply, help clients, and improve WPML based on what you discover.</p>\n<h3>Indicators You're a Great Fit:</h3>\n<ul>\n<li>\n<p>You have strong PHP experience and are motivated to keep sharpening your skills.</p>\n</li>\n<li>\n<p>Expert in WordPress, including setting up a local dev environment, navigating the admin backend, adjusting settings, and having basic development knowledge.</p>\n</li>\n<li>\n<p>You’re experienced in debugging issues, tracing root causes, and suggesting meaningful product improvements.</p>\n</li>\n<li>\n<p>Believe in writing tests and clean, reliable code.</p>\n</li>\n<li>\n<p>Enjoy investigating problems and fixing root causes.</p>\n</li>\n<li>\n<p>You’re fluent in English, and French, German, or Spanish.</p>\n</li>\n<li>\n<p>You communicate clearly and genuinely, and you enjoy helping others.</p>\n</li>\n</ul>\n<h4>Nice to have experience with:</h4>\n<ul>\n<li>\n<p>React&nbsp;</p>\n</li>\n<li>\n<p>MySQL</p>\n</li>\n<li>\n<p>Customer support</p>\n</li>\n</ul>\n<h3>What You'll Do</h3>\n<ul>\n<li>\n<p>Deliver new features and strengthen existing components.</p>\n</li>\n<li>\n<p>Support WPML clients and solve technical problems.</p>\n</li>\n<li>\n<p>Strengthen your expertise in PHP, WordPress, testing, performance, and modern tooling.</p>\n</li>\n</ul>\n<h3>Why This Role Works Well for Developers</h3>\n<ul>\n<li>\n<p>Direct connection to real problems: You see issues before they turn into technical debt and can fix them properly.</p>\n</li>\n<li>\n<p>Stronger product intuition: Support cases reveal edge cases, integrations, and workflows you won’t discover from code alone.</p>\n</li>\n<li>\n<p>Your code has an immediate impact: You’ll build features for one of the most used multilingual solutions in the world and help improve its reliability.</p>\n</li>\n<li>\n<p>You influence the roadmap: What you learn from users feeds directly into better architecture and long-term fixes.</p>\n</li>\n</ul>\n<p><strong>If you want to learn fast, make a visible impact, and join a global team that cares about quality – apply today, and we’d love to meet you!</strong></p>\n<p>&nbsp;</p>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/onthegosystems-senior-php-developer-3\">https://weworkremotely.com/remote-jobs/onthegosystems-senior-php-developer-3</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/cortes-23-software-engineer-3",
    "title": "Software Engineer",
    "company": "Cortes 23",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"https://cortes23.com\">https://cortes23.com</a>\n</p>\n\n<div>\n<div><strong>Please apply with the \"Apply Now\" button below. Applications not sent to the WWR email will not be considered.</strong></div>\n<div>&nbsp;</div>\n<div><strong>About the role</strong></div>\n<div>&nbsp;</div>\n<div>We’re looking for a software engineer who wants to build end-to-end. You’ll report directly to the CTO and work across our React/Next.js frontend and TypeScript backend to ship new features into production. Occasionally, you’ll work with Python to build data pipeline integrations with our partners.</div>\n<br>\n<div><strong>What you’ll do</strong></div>\n<ul>\n<li>Implement new product features end-to-end in React, TypeScript, and Next.js (from data layer to UI).</li>\n<li>Work with well-defined specifications, so you can focus on building instead of untangling unclear requirements.</li>\n<li>Extend and reuse existing modules and components, keeping things consistent and maintainable.</li>\n<li>Write tests and maintain code quality, ensuring reliability and readability.</li>\n<li>Participate in CI/CD workflows, helping ensure smooth, repeatable deployments.</li>\n</ul>\n<br>\n<div><strong>What we’re looking for</strong></div>\n<ul>\n<li>2–5+ years of professional software engineering experience.</li>\n<li>Strong experience with React and TypeScript, comfortable with modern patterns and tooling.</li>\n<li>Hands-on experience with Next.js, including routing and data fetching.</li>\n<li>Experience with CI/CD pipelines and shipping code to production.</li>\n<li>Proven track record of deploying software and owning features through release.</li>\n<li>Clear, direct communication and a builder mindset: you like taking a specification and making it real.</li>\n</ul>\n<br>\n<div><strong>Nice to have</strong></div>\n<ul>\n<li>Experience with serverless or cloud-native architectures.</li>\n<li>Experience working in a JavaScript/TypeScript monorepo.</li>\n<li>Familiarity with infrastructure-as-code or deployment automation tools.</li>\n<li>Experience with Pulumi (with SST) and the event-driven architecture.</li>\n<li>Familiarity with Python and data pipelines.</li>\n</ul>\n<div>\n<p>&nbsp;</p>\n<p><strong>What you’ll get from us</strong></p>\n<ul>\n<li>Remote forever.</li>\n<li>Casual work environment.</li>\n<li>Opportunity to work with a growing, international team.</li>\n<li>In-person meet-ups with our global team twice per year.</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Interview process</strong></p>\n<ol>\n<li>Initial screening call.</li>\n<li>Live coding interview.</li>\n<li>Take-home assignment.</li>\n<li>Deep-dive interview.</li>\n<li>Conversations with key members of our team.</li>\n</ol>\n</div>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n<div>\n<p>&nbsp;</p>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/cortes-23-software-engineer-3\">https://weworkremotely.com/remote-jobs/cortes-23-software-engineer-3</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/dreamrider-productions-careers-web-developer",
    "title": "Web Developer",
    "company": "DreamRider Productions Careers",
    "location": "British Columbia",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> remote Vancouver, BC, Canada . contract               . December 7, 2023\n    <br /><strong>URL:</strong> <a href=\"http://dreamriderproductions.com\">http://dreamriderproductions.com</a>\n</p>\n\n<div><strong>Position</strong>: Web Developer</div><div><strong>Reporting to: </strong>Director of Partnerships &amp; Operations</div><div><strong>Hours of Work</strong>: Full time, 35 hours per week, 12-week Fixed Contract</div><div><strong>Location</strong>:&nbsp;Remote from where you are happiest (Canadian timezones)</div><div><strong>Start Date:&nbsp;</strong>December 29, 2023</div><div><strong>Closing date</strong>: December 13, 2023 @ 5pm PST</div><div>&nbsp;</div><div><strong>Eligibility</strong>: This job will be funded through the Government of Canada’s Digital Skills for Youth (DS4Y) initiative, so only applicants aged between 15-30 years old will be eligible.</div><div>&nbsp;</div><div><strong>The Opportunity</strong></div><div>You are an emerging full-stack developer and designer with a creative flair looking for your next exciting challenge with an innovative values-aligned company. Our transformational learning approach turns kids and adults of all ages into leaders of change in their families and communities, and we need your help to tell our story to the world through a new company website. This is a unique opportunity to make a huge impact on our long-term growth trajectory!</div><div>&nbsp;</div><div><strong>About DreamRider Productions</strong></div><div>Over a million kids around the world have laughed, learned and leapt into action to protect the planet after experiencing DreamRider’s highly engaging theatre and interactive media programs. We partner with government agencies, corporate partners and philanthropic foundations to support their sustainability goals through our unique transformational engagement approach. While our award-winning <a href=\"https://planetprotectoracademy.com/\">Planet Protector Academy</a> program has a dedicated product-focused website, we do not currently have an active website for our company as a whole. As we dream and envision our next big project, we need a new company website that can showcase our 20+ years of engagement and culture change expertise to help us fundraise and garner support for this next exciting chapter!</div><div>&nbsp;</div><div><strong>Our Values</strong></div><div>Everything we do is guided by our <a href=\"https://www.dropbox.com/s/13s20g6my5v252w/Cultural%20Covenant.pdf?dl=0\">Cultural Covenant</a> to ensure that we work and grow together in an environment that’s fun, creative, welcoming, meaningful, empowering and inspiring! At the heart of all our work is love and kindness; we do our best to walk our talk, and to learn and grow together. We are on a lifelong organizational anti-racism, decolonization and anti-oppression journey. We recognize our interconnectedness with the earth and each other.</div><div><br></div><div><strong>The Role</strong></div><ul><li>You will lead on the development of a new company website for DreamRider to showcase its expertise and experience in engagement and culture change work</li><li>You will oversee the entire website creation process from conception to launch, with content writing support from the Executive Producer</li><li>You will work with a variety of stakeholders, including the DreamRider team and external stakeholders where appropriate to inform the website’s design and content</li></ul><div><br></div><div><strong>Key Responsibilities</strong></div><ul><li>Develop a comprehensive project plan detailing timelines, milestones, and deliverables to ensure the project is completed on time</li><li>Coordinate with DreamRider team and external stakeholders to define project goals, target audience, and desired website functionalities</li><li>Design a user-friendly website layout considering the latest web design trends and DreamRider Productions’ brand identity</li><li>Develop the website using appropriate web development technologies (e.g., HTML, CSS, JavaScript, CMS platforms)</li><li>Ensure the website is responsive and optimized for various devices</li><li>Collaborate with the content team to develop engaging and relevant content (text, images, videos) for the website</li><li>Implement content management features to allow non-technical staff to update website</li><li>Use SEO best practices to enhance the website’s visibility and search engine ranking</li><li>Conduct thorough testing of the website, including functionality, compatibility, and usability tests</li><li>Address and resolve any technical issues or bugs before launching</li><li>Oversee the website launch ensuring a smooth transition</li><li>Monitor website performance post-launch and make necessary adjustments for optimization</li></ul><div><strong>&nbsp;</strong></div><div><strong>Role Requirements</strong></div><div>If you are inspired by the role but don’t have everything that’s listed below, we encourage you to apply anyway!</div><ul><li>Strong organizational and project management skills</li><li>Experience creating visually appealing and user-friendly website layouts, with a good eye for design and UX/UI principles</li><li>Proficiency in front-end technologies such as HTML5, CSS3 and JavaScript</li><li>Familiarity with Content Management Systems such as WordPress, Joomla, or Drupal</li><li>Knowledge of Search Engine Optimization techniques and best practices</li><li>Excellent problem-solving skills and attention to detail</li><li>Ability to present complex technical information to non-technical audiences</li><li>Excellent written and verbal communication skills</li><li>Strong creativity and problem-solving skills</li><li>Legally entitled to work in Canada</li></ul><div><em>&nbsp;</em></div><div><em>Nice to have</em></div><ul><li>Proven experience with creative/arts-focused projects</li><li>Experience in using project management tools like Asana, Trello, or JIRA.</li><li>Experience creating marketing content for websites</li></ul><div><br></div><div><strong>Perks</strong></div><ul><li>Paid time for sickness and personal days</li><li>Flexible working hours to help you better balance work and life commitments</li><li>Home office stipend</li><li>Kind and collaborative working culture that’s on the cutting edge of organizational practices (see Margaret Wheatley, Otto Scharmer)</li><li>Ongoing DEI training to support personal development &amp; organizational capacity building</li></ul><div>&nbsp;</div><div><strong>How to apply</strong>: submit your application along with your resume through our online job board.</div><div>&nbsp;</div><div><strong>Application process</strong></div><ul><li>Stage 1: Application submission</li><li>Stage 2: 15-minute screening phone call with hiring manager</li><li>Stage 3: 45-minute video call with hiring manager and Creative Director</li><li>Stage 4: Reference checks</li><li>Stage 5: Offer</li></ul><div>&nbsp;</div><div>Predetermined interview questions will be sent ahead of time.</div><div>&nbsp;</div><div><strong>Questions?</strong></div><div>As part of our efforts to offer a fair and consistent interview process for all applications, we regret that we can’t answer any questions ahead of the application deadline. If you have a disability and would like to discuss accommodation of your disability and ensure fairness in our hiring process, please contact us on <a href=\"mailto:sion@dreamriderproductions.com\">sion@dreamriderproductions.com</a> or call 604-757-3212 before December 11, 2023.</div><div><br></div><div>Our remote team is based on many different Indigenous Peoples’ native lands and our head office is located in Port Moody, BC, which is situated on the unceded territories of the Kwikwetlem (Coquitlam), qiqéyt (Qayqayt), xʷməθkʷəy̓əm (Musqueam), sḵwx̱wú7mesh (Squamish), sel̓íl̓witulh (Tsleil Waututh), and Coast Salish peoples. We are committed to truth &amp; reconciliation in action.</div>\n\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/dreamrider-productions-careers-web-developer\">https://weworkremotely.com/remote-jobs/dreamrider-productions-careers-web-developer</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/walker-smith-senior-web-developer-remote",
    "title": "Senior Web Developer (Remote)",
    "company": "Walker Smith",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3761/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Dunedin, New Zealand\n    <br /><strong>URL:</strong> <a href=\"http://walkersmith.co.nz\">http://walkersmith.co.nz</a>\n</p>\n\n<div class=\"mt-5\">\n\n<div class=\"redactor-styles\">\n<h1>JOB DESCRIPTION</h1>\n<p> </p>\n<p> </p>\n<p><strong>Position Title</strong></p>\n<p> </p>\n<p> </p>\n<p>Senior Web Developer</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><strong>Name</strong></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><strong>Reports To</strong></p>\n<p> </p>\n<p> </p>\n<p>Web Development Lead</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><strong>Department</strong></p>\n<p> </p>\n<p> </p>\n<p>ICT</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><strong>Trends Overview</strong></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><strong>VISION:</strong></p>\n<p>TRENDS. The Best   Promotional supplier in Australasia. Recognised and admired industry wide as   the benchmark in innovation, product reliability and print quality, delivery   speed and outstanding customer service.</p>\n<p><strong>MISSION:</strong></p>\n<p>As the industry   leader, TRENDS will provide our customers with easy, efficient access to a   select range of innovative products, superior printing, world class customer   service, and the business and technology services necessary to increase their   sales and profits.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><strong>Job Purpose &amp; Function</strong></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Under the guidance of the Web Development Lead, the Senior Web   Developer is responsible for the planning and development of web and other   technology projects required to support the development of a new business   division. This will require contributing to and being involved in the   planning and direction of the division, building websites and other business   tools according to agreed specifications, prioritising development projects   according to the needs of the business, and overseeing suppliers, platforms and   technologies required for hosting of company websites. </p>\n<p> </p>\n<p> </p>\n<h1>ORGANISATIONAL STRUCTURE</h1>\n<h1>KEY RELATIONSHIPS</h1>\n<p>The role will require close working relationships with the following stakeholders:</p>\n<p> </p>\n<p> </p>\n<p><strong>Major Internal Contacts Within   Trends</strong></p>\n<p> </p>\n<p> </p>\n<p><strong>Major External Contacts</strong></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<ul><li>Chief Information Officer</li><li>Web Development Lead</li><li>ICT Department</li><li>Marketing Department</li><li>All other Departments when required</li><li>Third Party solution suppliers, providers,   consultants, and subject matter experts as and when required.</li></ul>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<h1>KEY RESULT AREAS</h1>\n<p>The position of <strong>Senior Web Developer</strong>\nencompasses the following key result areas:</p>\n<p> </p>\n<p> </p>\n<p><em><strong>KRAs</strong></em></p>\n<p> </p>\n<p> </p>\n<p><em><strong>Key Accountabilities</strong></em></p>\n<p> </p>\n<p> </p>\n<p><em><strong>Performance Measures</strong></em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em><strong>Quality/Accuracy   of Work</strong></em></p>\n<p> </p>\n<p> </p>\n<ul><li><em>Ensure that all web development and associated   projects are fully functional and built in accordance with agreed   specifications. </em></li><li><em>Identify areas for continuous improvement, create   project plans and coordinate appropriate solutions. </em></li><li><em>Ensure the smooth integration of web development   projects that deliver to the needs of the business long-term.</em></li></ul>\n<p> </p>\n<p> </p>\n<p><em><strong>Quality of Work</strong></em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em><strong>Work Output/Time   Management</strong></em></p>\n<p> </p>\n<p> </p>\n<ul><li><em>Prioritise development projects according to the   needs of the business and assign tasks to team members.</em></li><li><em>Ensure all web development projects are completed   within allocated timeframes.</em></li><li><em>Maintain and manage your workload at an acceptable   output.</em></li></ul>\n<p> </p>\n<p> </p>\n<p><em><strong>Work Output</strong></em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em><strong>Attitude &amp;   Culture</strong></em></p>\n<p> </p>\n<p> </p>\n<ul><li><em>Display a positive and professional attitude toward   work, colleagues, and ongoing learning.</em></li><li><em>Promote a culture of continuous improvement and   proactive problem-solving within the team.</em></li><li><em>Take ownership and accountability for assigned   tasks and responsibilities.</em></li><li><em>Show commitment to achieving both personal and team   goals.</em></li><li><em>Contribute positively to team dynamics by being   cooperative, solution-focused, and dependable under pressure.</em></li></ul>\n<p> </p>\n<p> </p>\n<p><em><strong>Acts Above the   Line</strong></em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em><strong>Interpersonal   Relationships</strong></em></p>\n<p> </p>\n<p> </p>\n<ul><li>Foster positive and professional working   relationships with both internal colleagues and external stakeholders.</li><li>Assist and support team members and leaders by   sharing knowledge of relevant processes, policies, and tasks.</li><li>Handle inquiries and requests in a   professional, accurate, and solution-focused manner.</li><li>Work collaboratively with supervisors, team   leads, and peers to ensure alignment on goals and expectations.</li><li>Show   respect for leadership and team structures by following established protocols   and directions.</li></ul>\n<p> </p>\n<p> </p>\n<p><em><strong>Acts as a   Cooperative Team Member</strong></em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em><strong>Communication</strong></em></p>\n<p> </p>\n<p> </p>\n<ul><li><em>Maintain open and transparent communication with   management, team leaders, and colleagues to support smooth workflow and   decision-making.</em></li><li><em>Clearly convey operational, administrative, or   task-related requirements across teams and departments.</em></li><li><em>·         </em><em>Express   ideas, updates, and concerns concisely and professionally in both group   settings and one-on-one interactions.</em></li></ul>\n<p> </p>\n<p> </p>\n<p><em><strong>Demonstrates   Appropriate and Open Communication</strong></em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em><strong>Health &amp;   Safety</strong></em></p>\n<p> </p>\n<p> </p>\n<ul><li>         Ensure that all company established and   Worksafe NZ requirements, policies and practices are complied with.</li><li><em>Immediately report all   accidents, incidents, near misses and hazards.</em></li><li><em>Keep work areas clean and   tidy</em></li><li><em>Ensure all PPE is worn as   required by the company.</em></li></ul>\n<p> </p>\n<p> </p>\n<p><em><strong>Compliance with   H&amp;S Expectations</strong></em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em><strong>Technical Skills</strong></em></p>\n<p> </p>\n<p> </p>\n<ul><li><em>Build websites and other   business tools according to agreed upon specifications. </em></li><li><em>Ensure the efficient and   functional development, testing, and maintenance of all web development   projects and other ecommerce projects.</em></li><li><em>Contribute to and be   involved in the planning and direction of the E-commerce division. </em></li><li><em>Oversee suppliers, platforms   and technologies required for hosting of company websites.</em></li><li><em>Research the best   technologies and platforms required to build solutions.</em></li><li><em>Assist with planning and   scoping requirements for web applications and their supporting systems.</em></li><li><em>Ensure robust testing of all projects to identify any bugs   or fixes required.</em></li></ul>\n<p> </p>\n<p> </p>\n<p><em><strong>Demonstrated   Competency and Understanding</strong></em></p>\n<p> </p>\n<p> </p>\n<h1><em>PERSON SPECIFICATION</em></h1>\n<p> </p>\n<p> </p>\n<h2><em>Education / Qualifications</em></h2>\n<p> </p>\n<p> </p>\n<ul><li><em>Recognised Qualification in a related field such as Computer Science, Web Development &amp; Design, or ICT, and/or at least 4-years experience in the below areas.</em></li></ul>\n<h2><em>Experience</em></h2>\n<ul><li><em><strong>Full Stack Development – </strong></em><em>Significant experience with most of the following technologies: Strong focus and skillset around the Laravel suite and framework, React, TypeScript, InertiaJS, TailwindCSS/UI, Serverless, OOP, MVC, Creating effective test suites, Browser Testing, Performance Monitoring, Load Testing, Effective caching strategies, Database and query optimisation, Modular Monilinth design, custom composer and NPM package development, strong focus on security considerations, continuing growth on AI technologies and patterns, Multi Tenancy and multi environment application development and management, proven track record of integrations with disparate systems across a range of protocols, strong understandingly of the underlying technologies powering the web, Networking experience.</em></li><li><em><strong>E-commerce – </strong></em><em>experience developing complex </em><em>E-commerce solutions and working with E-commerce platforms and channels. </em></li><li><em><strong>Web Development/ Web Project Management</strong></em><em> - Experience planning and scoping requirements for web applications and supporting systems and effectively managing web development projects from beginning to end in alignment with business requirements. </em></li><li><em><strong>Troubleshooting</strong></em><em> – Considerable experience ensuring robust testing of all projects to identify any bugs or fixes as required.</em></li></ul>\n<p> </p>\n<p> </p>\n<h2>Key competencies/ Skills</h2>\n<p> </p>\n<p> </p>\n<ul><li><strong>Time Management Skills – </strong>able to complete and self-direct own work to ensure timely completion of project deliverables.\n</li><li><strong>Programming Skills (Front &amp; Back-End)– </strong><em>Significant experience with most of the following technologies: Strong focus and skillset around the Laravel suite and framework, React, TypeScript, TailwindCSS, Serverless, OOP, MVC, Creating effective test suites, Browser Testing, Performance Monitoring, Load Testing, Effective caching strategies, Database and query optimisation, Modular design, custom composer and NPM package development, strong focus on security considerations, continuing growth on AI technologies and patterns, Multi Tenancy and multi environment application development and management, proven track record of integrations with disparate systems.</em></li><li><strong>Web Development – </strong>Ability to build web applications, services, integrations and APIs in accordance with specifications</li><li><strong>Troubleshooting Skills – </strong>high level of competency and skills developed in troubleshooting and identifying bugs and fixes </li><li><strong>Project Management Skills – </strong>full range of project management skills inclusive of time-management, costing control and critical thinking. </li><li><strong>Analytical Skills – </strong>high level of attention to detail and methodical approach to ensure a functional solution is developed. </li><li><strong>Interpersonal Skills – </strong>ability to engage and communicate with a variety of managers, team leaders, and team members to ensure a solution is developed that is functional to the needs of both consumers and business areas involved in its operation. </li><li><strong>Communication Skills – </strong>ability to articulate complex information in a clear manner.</li></ul>\n<h1><em>VALUES</em></h1>\n<h1><em>DAY-TO-DAY BEHAVIOURS</em></h1>\n<ul>\n<li>Ensure that you      treat all work colleagues and management with respect.  </li>\n<li>Discrimination      of any kind will not be tolerated.</li>\n<li>Exercise      accurate time keeping.</li>\n<li>Ensure all      property is treated with respect and used appropriately.</li>\n<li>Display a      positive attitude</li>\n<li>Keep work areas      clean and tidy</li>\n<li>Plan the days      work as efficiently as possible.</li>\n<li>Exercise      effective teamwork by helping others whenever possible</li>\n</ul>\n<h1><em>AMENDMENTS TO THE JOB DESCRIPTION</em></h1>\n<p>From time to time it may be necessary to consider changes in the job description in response to the changing nature of our work environment – including technological requirements or statutory changes. This Job Description may be reviewed as part of the preparation for performance planning for the annual performance cycle or as required. </p>\n<h1><em>NON-LIMITATION CLAUSE</em></h1>\n<p><em>This Job Description is not intended to be a complete or limiting description of the functions that the employee may reasonably be requested to undertake. </em></p>\n<h1><em>ACCEPTANCE</em></h1>\n<p><em>I have read and understood the above position description and accept all the responsibilities incorporated herein. </em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n</p>\n</div>\n\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/walker-smith-senior-web-developer-remote\">https://weworkremotely.com/remote-jobs/walker-smith-senior-web-developer-remote</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/webflow-enterprise-account-executive-west",
    "title": "Enterprise Account Executive - West",
    "company": "Webflow",
    "location": "Worldwide",
    "salary_raw": "$250,000 - $280,000",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3760/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> CA Remote (BC &amp; ON only); U.S. Remote\n    <br /><strong>URL:</strong> <a href=\"http://webflow.com\">http://webflow.com</a>\n</p>\n\n<div class=\"job__description body\"><div><p>At Webflow, we’re building the world’s leading AI-native Digital Experience Platform, and we’re doing it as a remote-first company built on trust, transparency, and a whole lot of creativity. This work takes grit, because we move fast, without ever sacrificing craft or quality. Our mission is to bring development superpowers to everyone. From entrepreneurs launching their first idea to global enterprises scaling their digital presence, we empower teams to design, launch, and optimize for the web without barriers. We believe the future of the web, and work, is more open, more creative, and more equitable. And we’re here to build it together.</p>\n<p>We’re looking for an Enterprise Account Executive to help us develop and implement strategies to grow Webflow’s presence upmarket and build meaningful relationships with both potential and existing customers.</p>\n<h1><strong>About the role:</strong></h1>\n<ul>\n<li>Location: Remote-first (United States; BC, Canada). *<em>*Must reside in Pacific or Mountain Time Zone.&nbsp;</em>\n<ul>\n<li>This role will require an in-person onboarding session in San Francisco, CA</li>\n</ul>\n</li>\n<li>Full-time&nbsp;</li>\n<li>Permanent</li>\n<li>Exempt</li>\n<li>Our cash compensation amount for this role ranges depending on the cost of labor of the geographic area. The ranges shared below may change if you are hired in another geographic location.&nbsp;<br><br>\n<ul>\n<li>United States&nbsp; (all figures cited below in USD and pertain to workers in the United States)<br>\n<ul>\n<li>Zone A: $250,000 - $280,000</li>\n</ul>\n</li>\n<li>Canada&nbsp; (All figures cited below in CAD and pertain to workers in ON, Canada)\n<ul>\n<li>302,000 - 338,000</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>For sales roles, the ranges provided are the role’s On Target Earnings (“OTE”) ranges, meaning that the ranges include both the sales commissions target and annual base salary for the role. This salary range may be inclusive of several career levels at Webflow and will be narrowed during the interview process based on a number of factors, including the candidate’s<strong> </strong>market location, job related experience, knowledge, qualifications, and skills. Benefits/additional compensation for this role may include: equity, company bonus or sales commissions/bonuses; retirement plans; health benefits; and wellness stipends<em><br></em></p>\n<p>Please visit our <a href=\"https://webflow.com/careers#pay-zones\">Careers page</a> for more information on which locations are included in each of our geographic pay zones. However, please confirm the zone for your specific location with your recruiter.</p>\n<ul>\n<li>Application Information:\n<ul>\n<li>Application deadline: applications accepted on an ongoing basis until position is closed and filled</li>\n<li>This posting is for a new position</li>\n</ul>\n</li>\n<li>Reporting to the Sr. Manager, Enterprise Sales</li>\n</ul>\n<p>As an <strong>Enterprise Account Executive</strong>, you’ll …&nbsp;</p>\n<ul>\n<li>Meet with potential Enterprise customers, deeply understand their problems, and assess whether or not Webflow is a good fit&nbsp;</li>\n<li>Build a sales pipeline and drive the full sales cycle from identifying new prospects to close</li>\n<li>Establish and maintain relationships with key stakeholders within prospect and customer accounts</li>\n<li>Negotiate annual or multi-year software contracts</li>\n<li>Position and communicate Webflow’s vision, solution, and value propositions</li>\n<li>Work cross-functionally with marketing, product, design, education and engineering to execute sales strategy</li>\n<li>Collaborate with Customer Success to build high-quality onboarding and customer experiences</li>\n<li>Travel up to 25-50% - onboarding, customer meetings, industry events, and internal offsites</li>\n</ul>\n<h1><strong>About you:</strong></h1>\n<p>Requirements:</p>\n<ul>\n<li>BA/BS degree or equivalent experience</li>\n</ul>\n<p>You’ll thrive as an&nbsp;<strong>Enterprise Account Executive</strong> if you:</p>\n<ul>\n<li>Bring 5-7 years quota carrying experience with 3-4+ years in a complex SaaS sales cycles at larger companies involving multiple stakeholders.</li>\n<li>Demonstrate a&nbsp;strong ability to prospect and hunt new logos autonomously.</li>\n<li>Show a proven track record of closing complex sales cycles with a disruptive B2B SaaS product</li>\n<li>Collaborate effectively across teams like Product, Engineering, Support, and Marketing to drive business impact.</li>\n<li>Love testing, tracking, and iterating on your sales process.</li>\n<li>Thrive in ambiguous environments and work independently.</li>\n<li>Show passion for the no-code space and interest in web design, development, or Webflow products.</li>\n<li>Embody a growth mindset and a drive for continuous improvement.</li>\n<li>Stay curious and open to growth — actively building fluency in emerging technologies like AI to unlock creativity, accelerate progress, and amplify impact.</li>\n</ul>\n<h3><strong>Our Core Behaviors:</strong></h3>\n<ul>\n<li><strong>Build lasting customer trust. </strong>We build trust by taking action that puts customer trust first.</li>\n<li><strong>Win together.</strong> We play to win, and we win as one team. Success at Webflow isn't a solo act.</li>\n<li><strong>Reinvent ourselves. </strong>We don't just improve what exists, we imagine what's possible.</li>\n<li><strong>Deliver with speed, quality, and craft.</strong> We move fast because the moment demands it, and we do so without lowering the bar.</li>\n</ul>\n<h3><strong>Benefits</strong></h3>\n<ul>\n<li><strong>Ownership in what you help build.</strong> Every permanent Webflower receives equity (RSUs) in our growing, privately held company.</li>\n<li><strong>Health coverage that actually covers you.</strong> Comprehensive medical, dental, and vision plans for full-time employees and their dependents, with Webflow covering most premiums.</li>\n<li><strong>Support for every stage of family life</strong>. 12 weeks of paid parental leave for all parents and 6+ weeks of additional paid leave for birthing parents. Plus inclusive care for family planning, menopause, and midlife transitions.</li>\n<li><strong>Time off that’s actually off. </strong>Flexible vacation, paid holidays, and a sabbatical program to help you recharge and come back inspired.</li>\n<li><strong>Wellness for the whole you. </strong>Access to mental health resources, therapy and coaching.</li>\n<li><strong>Invest in your future. </strong>A 401(k) with 100% employer match (up to $6,000/year) in the U.S., and support for retirement savings globally.&nbsp;</li>\n<li><strong>Monthly stipends that flex with your life.</strong> Localized support for work and wellness expenses — from Wi-Fi to workouts.</li>\n<li><strong>Bonus for building together. </strong>All full-time, permanent, non-commission employees are eligible for our annual WIN bonus program.</li>\n</ul>\n<p><em>Temporary employees may be eligible for paid holiday and time off, statutory leaves of absence, and company-sponsored medical benefits depending on their Fixed Term Contract and their country/state of employment.</em></p>\n<h3><strong>Remote, together</strong></h3>\n<p>At Webflow, equality is a core tenet of our culture. We are an Equal Opportunity (EEO)/Veterans/Disabled Employer and are <a href=\"https://webflow.com/diversity-equity-inclusion\">committed</a> to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law. Pursuant to the San Francisco Fair Chance Ordinance, Webflow will consider for employment qualified applicants with arrest and conviction records.</p>\n<h3><strong>Stay connected</strong></h3>\n<p>Not ready to apply, but want to be part of the Webflow community? Consider following our story on our <a href=\"https://webflow.com/blog\">Webflow Blog</a>, <a href=\"https://www.linkedin.com/company/webflow-inc-/\">LinkedIn</a>, <a href=\"https://twitter.com/webflow\">X (Twitter)</a>, and/or <a href=\"https://www.glassdoor.com/Reviews/Webflow-Reviews-E890506.htm\">Glassdoor</a>.&nbsp;</p>\n<h3><strong>Please note:</strong></h3>\n<p><em>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Upon interview scheduling, instructions for confidential accommodation requests will be administered.</em></p>\n<p><em>To join Webflow, you'll need a valid right to work authorization depending on the country of employment.</em></p>\n<p><em>If you are extended an offer, that offer may be contingent upon your successful completion of a background check, which will be conducted in accordance with applicable laws. We may obtain one or more background screening reports about you, solely for employment purposes.</em></p>\n<p><em>For information about how Webflow processes your personal information, please review </em><a href=\"https://webflow.com/legal/applicant-privacy-notice\"><em>Webflow’s Applicant Privacy Notice</em></a><em>.&nbsp;</em></p>\n<p>&nbsp;</p></div></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/webflow-enterprise-account-executive-west\">https://weworkremotely.com/remote-jobs/webflow-enterprise-account-executive-west</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": {
      "min": 250,
      "max": 280
    },
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/dealer-eprocess-regional-sales-executive-account-manager-1",
    "title": "Regional Sales Executive (Account Manager)",
    "company": "Dealer eProcess",
    "location": "Arizona",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"http://dealereprocess.com\">http://dealereprocess.com</a>\n</p>\n\n<div class=\"col col-xs-7 description\">\n<p><span><span><span><span><span><span>Job Description:</span></span></span></span></span></span></p><p><span><span><span><span><span><span>Dealer eProcess, a leading provider of digital marketing solutions for automotive dealerships, is looking for a highly motivated Salesperson (Account Manager) to join our growing team. This role is a fantastic opportunity for a go-getter who thrives in a results-driven environment and is passionate about sales. The primary focus will be generating new business by reaching out to car dealerships, booking product demonstrations, and closing sales.</span></span></span></span></span></span></p><p><span><span><span><span><span><span>The ideal candidate will demonstrate the ability to confidently pick up the phone and make calls to assigned dealerships, with a relentless drive to succeed. We seek individuals who are disciplined in managing their sales pipeline and are committed to logging all their activities in our CRM to ensure accurate tracking and follow-up.</span></span></span></span></span></span></p><h3><span><span><span><span><span><span>Key Responsibilities:</span></span></span></span></span></span></h3><ul><li><span><span><span><span><span><span>Prospect &amp; Outreach: Consistently make outbound calls to assigned car dealerships to generate leads, establish relationships, and book product demonstrations.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>CRM Management: Diligently log all activities, including calls, emails, and meetings, in the CRM to maintain accurate and up-to-date records of your interactions.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>New Business Focus: Drive new business development as your core function, focusing on bringing new dealerships into the Dealer eProcess portfolio.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>Master Prospecting: Demonstrate your skills in prospecting and lead generation. This is the foundation of your role and the first step in growing within the company.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>Learn to Demo: Once you have consistently shown success in setting up product demonstrations, receive training on how to present our products effectively to prospective clients.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>Sales Ownership: After mastering prospecting and product demonstrations, take full ownership of the sales process—from lead generation to closing deals.</span></span></span></span></span></span></li></ul><h3><span><span><span><span><span><span>Qualifications:</span></span></span></span></span></span></h3><ul><li><span><span><span><span><span><span>Sales Skills: Prior experience in sales, particularly outbound sales or telemarketing, is preferred. Automotive industry knowledge is a plus.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>Persistence &amp; Resilience: Must be comfortable making a high volume of calls and handling rejection with a positive attitude.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>CRM Familiarity: Experience using CRM software to log activities and track sales progress.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>Goal-oriented: Self-motivated with a strong desire to meet and exceed sales targets.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>Excellent Communication: Strong verbal and written communication skills, with the ability to build rapport over the phone.</span></span></span></span></span></span></li><li><span><span><span><span><span><span>Organized &amp; Detail-Oriented: Ability to manage multiple tasks simultaneously and follow through on commitments.</span></span></span></span></span></span></li></ul><p></p><p></p> </div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/dealer-eprocess-regional-sales-executive-account-manager-1\">https://weworkremotely.com/remote-jobs/dealer-eprocess-regional-sales-executive-account-manager-1</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/nutechs-fpga-development-engineer",
    "title": "FPGA Development Engineer",
    "company": "NuTechs",
    "location": "Michigan",
    "salary_raw": "$90,000",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3757/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Novi, MI 48304\n    <br /><strong>URL:</strong> <a href=\"http://nutechs.com\">http://nutechs.com</a>\n</p>\n\n<div class=\"job-description-container\">\n<div class=\"benefits\">\n<div><strong>Benefits:</strong></div>\n<ul>\n<li>Dental insurance</li>\n<li>Health insurance</li>\n<li>Paid time off</li>\n</ul>\n</div>\n<div class=\"trix-content\">\n<div>\n<strong>FPGA Development Engineer<br></strong><br>\n</div><div><br></div><div>\n<strong>Responsibilities<br></strong><br>\n</div><div>As a member of the embedded development group you will be part of a dynamic development team<br><br>\n</div><div>performing analysis, design and development of our next generation embedded products.<br><br>\n</div><div>Initially this will be on site until training is completed. Then it will transition to a Hybrid.<br><br>\n</div><div><br></div><div>\n<strong>Responsibilities will include:<br></strong><br>\n</div><ul>\n<li>Both new development and maintenance/enhancement to existing embedded designs</li>\n<li>Detailed technical design of system architecture and FPGA components based on requirements</li>\n<li>Development and execution of unit test procedures</li>\n<li>Development and execution of system test procedures</li>\n<li>Development and updating of documentation on work performed</li>\n</ul><div><br></div><div>\n<strong>Qualifications<br></strong><br>\n</div><div>The ideal candidate will have the following qualifications and skills:<br><br>\n</div><div>\n<strong>Desired Skills/Experience<br></strong><br>\n</div><ul>\n<li>Experience with using VHDL in the development of embedded products</li>\n<li>Experience using logic analyzers and oscilloscopes in the development of embedded products</li>\n<li>Experience with System on a Chip design</li>\n<li>Experience with Electrical Schematic Design</li>\n<li>Able to understand and intelligently debug existing systems</li>\n<li>Solid understanding of Object-Oriented methodologies and concepts in general</li>\n<li>Solid understanding of general programming software technology</li>\n<li>Understanding and appreciation of software development lifecycles</li>\n<li>Knowledge of and understanding of software design patterns</li>\n</ul><div><br></div><div>\n<strong>Bonus Skills/Experience<br></strong><br>\n</div><ul>\n<li>Experience with Xilinx chips</li>\n<li>Familiarity C++</li>\n<li>Familiarity with source control systems</li>\n<li>Familiarity with system interfaces such as CAN, JTAG, I2C, USB, and Ethernet</li>\n<li>Experience with SAE, ISO and ASAM standards</li>\n<li>Knowledge of data acquisition concepts and systems</li>\n<li>Knowledge of automobile and engine controls systems</li>\n</ul><div><br></div><div>\n<strong>Essential Non-Technical Skills<br></strong><br>\n</div><ul>\n<li>Positive proactive attitude and solid work ethic</li>\n<li>Strong communication skills</li>\n<li>Strong organizational skills</li>\n<li>Experience with Microsoft Office applications</li>\n<li>Detail-oriented and methodical coding mentality</li>\n<li>Willingness to follow processes and procedures</li>\n<li>Ability to work independently</li>\n</ul><div>\n<strong>Join Our Team<br></strong><br>\n</div><div>At NuTechs, we are always looking for talented IT Professionals to meet the needs of our employer partners.&nbsp; Whether you are looking for a short-term project or a long-term opportunity, we are here to help.</div><div>\n<br>&nbsp;If you specialize in the areas below, please submit your resume:</div><div>Application Development, Software &amp; Application Integration, Database Development &amp; Administration, Network &amp; Infrastructure Design, Systems Administration, Help Desk Services, ERP Implementation, Web Development<br>&nbsp;<br>&nbsp;</div><div>\n<strong>Why Choose NuTechs?&nbsp; NuTechs is EMPLOYEE friendly!!!<br></strong><br>\n</div><div>NuTechs is a diversified technical recruiting firm, and our passion is helping our clients build exceptional teams and assisting candidates with educated career moves. We take time to understand what is important to our clients and candidates as they develop their teams and careers. After all, a happy candidate leads to a happy client.<br>&nbsp;<br>&nbsp;</div><div>Company Website: <a href=\"http://www.nutechs.com/\">www.nutechs.com<br></a>\n</div>\n</div>\n<p>Work remote temporarily due to COVID-19.</p>\n<div class=\"job-compensation\">\n          Compensation: $90,000.00 - $115,000.00 per year\n        </div>\n<br><br><br> <div class=\"account_description\">\n</div>\n<br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/nutechs-fpga-development-engineer\">https://weworkremotely.com/remote-jobs/nutechs-fpga-development-engineer</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": {
      "min": 90,
      "max": 90
    },
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/aliqan-technologies-commerce-tools-node-js-cloud",
    "title": "Commerce Tools + Node JS + Cloud",
    "company": "ALIQAN Technologies",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Noida\n    <br /><strong>URL:</strong> <a href=\"http://aliqantechnologies.com\">http://aliqantechnologies.com</a>\n</p>\n\n<div><p>Job Title: Commerce Tools + Node JS + Cloud</p><p> Location: Remote</p><p>  Exp: 6 +yrs </p><p>Must have - Commerce Tools, NodeJS, JavaScript, Typescript, NextJS</p><p> Key Responsibilities: </p><p>* Front-End Development: Build and maintain responsive and high-performance user interfaces using Next.js, React, Chakra UI, and React Query. * Familiarity with Micro Front End Architecture * Design and develop server-side logic with Node.js and integrate APIs using tRPC. * TypeScript Expertise: Write type-safe, clean, and scalable code across both the front-end and back-end using TypeScript. * API Integration: Work with Contentful to manage content integration and consumption in a headless CMS environment. * Collaboration: Collaborate with designers, product managers, and other developers to create seamless user experiences. * Testing &amp; Debugging: Ensure high-quality code by writing unit tests, debugging, and optimizing both front-end and back-end performance. * Continuous Improvement: Stay up-to-date with the latest trends in web development, propose innovative solutions, and implement best practices. Mandatory Qualifications Required Skills &amp; Qualifications: * 6+ years of experience working with modern web technologies, particularly Next.js, React, and Node.js. * Strong experience with TypeScript for type-safe development. * Hands-on experience with React Query for data fetching and caching. * Proficiency with Chakra UI or other modern design systems for building intuitive, responsive UIs. * Experience with tRPC or similar libraries for creating type-safe APIs. * Familiarity with Contentful or other headless CMS platforms. * Solid understanding of RESTful APIs and GraphQL. * Experience with version control systems, particularly Git. * Strong debugging skills and familiarity with modern front-end and back-end debugging tools. * Strong communication skills and the ability to work collaboratively in a remote or hybrid team environment. Preferred Qualifications: * Familiarity with serverless architectures and deployment using services like Vercel or Netlify. * Experience with Docker, containerization, and CI/CD workflows. * Experience with GraphQL and Apollo Client. * Understanding of web security best practices.</p></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/aliqan-technologies-commerce-tools-node-js-cloud\">https://weworkremotely.com/remote-jobs/aliqan-technologies-commerce-tools-node-js-cloud</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/eran-group-senior-back-end-web-developer",
    "title": "Senior Back-End Web Developer",
    "company": "Eran Group",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3755/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> India\n    <br /><strong>URL:</strong> <a href=\"http://eranindustrial.com\">http://eranindustrial.com</a>\n</p>\n\n<div class=\"description\"><p><strong><br></strong></p>\n<p><strong>Position: </strong>Senior Back-End Web Developer</p>\n<p><strong>Location:</strong> Remote<br></p>\n<p></p>\n<h2><strong>About Us:</strong></h2>\n<p>Eran Group is a leading design, engineering &amp; manufacturing company dedicated to developing class-leading electrical goods for consumers and commercial uses. We are looking for a talented and experienced Front-End Web Developer to join our dynamic software team. </p>\n<h2><strong><br></strong><strong>Job Description:</strong></h2>\n<p>We are seeking a Senior Back-End Developer with a strong understanding of the latest web technologies and a keen eye for performance, business logic, and detail. The successful candidate will be responsible for server-side web application logic, database administration, security rules, and help integration to the front-end. You will work with front-end developers, software &amp; data engineers, and business &amp; marketing teams.  </p>\n<p>Furthermore, you will be expected to have a strong passion for learning new technologies and pushing your skillset and experience to ever-growing levels.</p>\n<h2><strong><br></strong><strong>Responsibilities:</strong></h2>\n<ol><li>Develop and maintain server-side logic.</li><li>Define and maintain databases, ensuring high performance and responsiveness.</li><li>Collaborate with front-end developers on the integration of elements.</li><li>Work with business &amp; marketing teams to understand &amp; document requirements.</li><li>Design and implement data storage solutions </li><li>Manage SQL, NoSQL, and/or KV databases and ensure their performance. </li><li>Develop cloud functions and help architect cloud-based solutions.</li><li>Implement auth, security, and data protection measures.</li><li>Integrate multiple data sources and databases into one system.</li><li>Troubleshoot and debug applications.</li><li>Collaborate with other team members and stakeholders.</li></ol>\n<p></p>\n<h2><strong>Qualifications:</strong></h2>\n<ol><li>Bachelor's or Master’s degree in Computer Science, a related field, or equivalent experience.</li><li>Proven experience as a Back-End Developer or similar role.</li><li>Proficient with Typescript</li><li>Familiarity with server-side language &amp; runtimes such as Node.js/Deno/Bun (experience with other server-side languages Python, Go, and/or Rust acceptable well).</li><li>Strong experience with cloud technologies, developing cloud functions, and helping orchestrate cloud services.</li><li>Proficiency with fundamental front-end languages such as HTML, CSS, and JavaScript/Typescript.</li><li>Knowledge of SQL and NoSQL databases and database administration (Postgres experience is a plus).</li><li>Excellent understanding of the entire web back-end development process</li><li>Strong understanding of designing &amp; maintaining APIs using RPC/tRPC, REST, GraphQL</li><li>Excellent verbal and written communication skills.</li><li>Strong problem-solving skills and a detail-oriented mindset.</li><li>Passion to learn and test new technology tools &amp; services. </li></ol>\n<p></p>\n<h2><strong>How to Apply:</strong></h2>\n<p>Interested candidates are invited to submit their resume, portfolio, and a brief cover letter outlining their experience and why they are the perfect fit for this role. Please include links to your work or GitHub profile.<br><br></p>\n<p>-----------------</p>\n<p>Eran Group is an equal-opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</p>\n<p>Note: This job description is intended to convey information essential to understanding the scope of the job and the general nature and level of work performed by job holders within this job. However, this job description is not intended to be an exhaustive list of qualifications, skills, efforts, duties, responsibilities, or working conditions associated with the position.</p>\n<p></p></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/eran-group-senior-back-end-web-developer\">https://weworkremotely.com/remote-jobs/eran-group-senior-back-end-web-developer</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3",
    "title": "Senior Shopify Developer (Remote + Flexible)",
    "company": "Storetasker",
    "location": "Worldwide",
    "salary_raw": "$100-$200",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0074/8032/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Brooklyn, NY\n    <br /><strong>URL:</strong> <a href=\"https://resources.storetasker.com/become-an-expert?apply=true&amp;source=weworkremotely_best_2021\">https://resources.storetasker.com/become-an-expert?apply=true&amp;source=weworkremotely_best_2021</a>\n</p>\n\n<h1>Shopify developers love to freelance with Storetasker.</h1><ul><li><strong>Endless, quality clients: </strong>from well known DTC brands to top agencies.&nbsp;</li><li><strong>Fully remote, flexible: </strong>work as much or as little as you want, wherever you want.&nbsp;</li><li><strong>A talented and helpful community: </strong>it's freelance (with a team).</li><li><strong>Earn $100-$200 per hour: </strong>pick your clients, and send your own quotes or retainers.&nbsp;<br><br></li></ul><div>We've connected our community of Shopify developers to over 32,000 e-commerce brands. From new brands pre-launch, to some of the most successful Shopify Plus sites, to top creative agencies. Clients include: <a href=\"https://www.alphaindustries.com/\">Alpha Industries</a>, <a href=\"https://www.bollandbranch.com/\">Boll &amp; Branch</a>, <a href=\"https://getsuperfluid.com\">Superfluid</a>, <a href=\"https://jackhenry.co/\">Jack Henry</a>, <a href=\"http://plenaire.co/\">Plenaire</a>, and <a href=\"https://walkfulton.com/\">Fulton</a> among many more. <br><br><strong>Why Storetasker?</strong></div><ul><li><strong>Endless clients &amp; project opportunities:</strong> you’ll see between 5 - 50 new opportunities per day and can pick any lead you want.&nbsp;</li><li><strong>You’ll earn more:</strong> some experts are making $250k+ per year.&nbsp;</li><li><strong>A high quality community:</strong> we carefully select about 5% of those who apply.&nbsp;</li><li><strong>Remote:</strong> work from anywhere, anytime.&nbsp;</li><li><strong>Flexible:</strong> take on as many clients as you want.</li><li><strong>No external ratings:</strong> you’re already a professional. No need to prove it.&nbsp;</li><li><strong>Great Software:</strong> that makes it easy to manage more clients and increase billable hours.</li><li><strong>Support when you need it:</strong> we offer project support 7 days per week.&nbsp;</li><li><strong>Community (not competition):</strong> you pick your clients, projects, and never compete against other Experts in the community.&nbsp;</li></ul><div><br></div><div><a href=\"https://www.storetasker.com/become-an-expert?&amp;source=weworkremotely_best_2021\"><strong>Learn more and join</strong></a>! It’s confidential, and takes less than 5 minutes. <br><br><strong>Here's who we're looking for:</strong></div><ul><li>Ambitious part time and full-time freelancers and boutique agencies.</li><li>Who have 3+ years of Shopify experience, and 5+ years of web development experience.&nbsp;</li><li>And who have managed projects, deadlines, and communication successfully.&nbsp;</li></ul><div><br><strong>Especially people with some of these skills:</strong></div><ul><li>Front-end or full-stack Shopify development</li><li>Headless e-commerce development</li><li>Conversion rate optimization</li><li>E-commerce expertise and strategy</li><li>SEO&nbsp;</li><li>Site Speed</li><li>Builder and/or Shogun</li></ul><div><br><a href=\"https://www.storetasker.com/become-an-expert?&amp;source=weworkremotely_best_2021\"><strong>It takes just a few minutes to join.</strong></a><br><br><strong>Here's what a few current members have to say:</strong><br><br>\"Storetasker has changed my life - I'm not only making more, but I'm getting quality leads, a diverse slate of projects, and access to an amazing group of developers. Plus, I love the HQ team!\" - Adan, United States, Storetasker Expert since March 2020<br><br>\"Storetasker has connected me with clients that would never have been possible without them. That combined with an incredible support network and community makes joining an amazing opportunity for any developer”\" - Mark, England, Storetasker Expert since 2019<br><br>\"Storetasker has allowed me to live out my dreams as an independent developer - to move to Toronto and continue doing what I love: solving interesting problems and helping apparel companies grow.\" - Siah, Canada, Storetasker Expert since 2017<br><br><strong>Our Mission: </strong><br><br>We're a company built by ex-freelancers who know the ins and outs of being an independent entrepreneur. We've experienced first-hand the shortcomings of other freelance platforms and the pain-points of being fully independent. Our mission is to empower e-commerce entrepreneurs by giving them the experts, insights, and resources to succeed.&nbsp; <br><br><strong>Questions?</strong> Reach out at experts@storetasker.com.</div><div><br></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3\">https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/servicetitan-manager-web-development",
    "title": "Manager, Web Development",
    "company": "ServiceTitan",
    "location": "Worldwide",
    "salary_raw": "$20k",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3710/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> US IN Remote\n    <br /><strong>URL:</strong> <a href=\"http://servicetitan.com\">http://servicetitan.com</a>\n</p>\n\n<div><h2><span>Ready to be a Titan?</span></h2><p><span>ServiceTitan is looking for an innovative Manager of Web Development who leads by example to join our Web Team. This hybrid player/coach role reports into the Director of Web Marketing and is designed for a leader who wants to stay technically grounded without being \"in the weeds\" 100% of the time.</span></p><p></p><p><span>You will split your focus between hands-on technical contribution (working tickets, architectural design, code reviews) and formal people management (1:1s, career development, and team health for both Dev and QA) while leading the end-to-end development and optimization of our four flagship marketing websites: </span><a href=\"https://www.servicetitan.com\"><span>www.servicetitan.com</span></a><span>, </span><a href=\"https://www.youraspire.com\"><span>www.youraspire.com</span></a><span>, </span><a href=\"https://www.convex.com\"><span>www.convex.com</span></a><span>, and </span><a href=\"https://www.fieldroutes.com\"><span>www.fieldroutes.com</span></a><span>.</span></p><p></p><p><span>Our websites are critical to the user journey and serve as the engine for our overall pipeline generation program. We are seeking a strategic thinker who understands the unique nuances of high-performance marketing websites compared to SaaS products. If you are a proactive problem-solver who excels in a rapid-growth environment, this is the place for you.</span></p><p></p><h2><span>What You'll Do:</span></h2><p><b><span>Technical Contribution&nbsp;</span></b></p><ul><li><p><b><span>Strategic Coding: </span></b><span>Rather than high-volume daily tasks, you will focus on high-impact tickets, complex bug fixes, or foundational architectural work.</span></p></li><li><p><b><span>Code Quality &amp; Reviews:</span></b><span> Act as the final line of defense for code quality. You will perform critical PR reviews and ensure that QA and Dev are tightly integrated.</span></p></li><li><p><b><span>Technical Unblocking:</span></b><span> Identify technical debt or workflow bottlenecks that slow the team down and get hands-on to resolve them.</span></p></li><li><p><span><b><span>Innovation &amp; Support: </span></b><span>Proactively identify and champion the adoption of new technologies (including AI integration) while providing ongoing support for existing features and security patches.</span></span></p></li><li><p><span><b><span>Project Leadership: </span></b><span>Operate as a Technical Lead, successfully launching and completing multiple large-scale technical projects simultaneously while impacting the immediate team's success.</span></span></p></li><li><p><span><b><span>Vendor Management:</span></b><span> Take the lead on working with third-party vendors for various integrations, ensuring seamless connectivity across our marketing stack.&nbsp;</span></span></p></li><li><p><span><b><span>Technical Architecture: </span></b><span>Lead the technical design and implementation of significant features that span multiple components, ensuring code quality, scalability, and adherence to best practices.</span></span></p></li><li><p><span><b><span>Process Improvement:</span></b><span> Develop and implement technical process improvements, such as advanced CI/CD strategies and new coding standards, to be adopted across the team.</span></span></p></li></ul><p></p><p><b><span>People &amp; Team Leadership&nbsp;</span></b></p><ul><li><p><span><b><span>Lead and Manage:</span></b><span> Serve as the direct people manager for our team of Web Developers and QA Engineers, fostering a culture of technical excellence and continuous growth.</span></span></p></li><li><p><b><span>Growth &amp; Performance:</span></b><span> Conduct regular 1:1s focused on both tactical output and long-term career progression. You will own performance reviews and compensation conversations.</span></p></li><li><p><b><span>Team Dynamics:</span></b><span> Actively manage interpersonal relationships and team culture. You are responsible for building a cohesive, high-trust environment across the Dev and QA disciplines.</span></p></li><li><p><b><span>Resource Planning:</span></b><span> Work with the Director of Web Marketing to balance team capacity with roadmap ambitions, ensuring the team is challenged but not burned out.</span></p></li></ul><p></p><h2><span>What You’ll Bring:</span></h2><ul><li><p><b><span>Balanced Perspective: </span></b><span>You understand that \"winning\" means the team is shipping great software, not just that you personally finished a ticket.</span></p></li><li><p><b><span>Technical Empathy:</span></b><span> Because you still push code, you have a realistic pulse on the codebase, which informs how you manage deadlines and individual performance.</span></p></li><li><p><b><span>Mentorship Mindset:</span></b><span> You enjoy the challenge of coaching a QA engineer on automation strategy just as much as helping a developer optimize a database query.</span></p></li><li><p><span><b><span>Management &amp; Soft Skills: </span></b><span>Excellent communication and collaboration skills with a proven ability to manage direct reports and influence cross-functional stakeholders.</span></span></p></li><li><p><b><span>Problem Solving:</span></b><span> Strong ability to troubleshoot complex, cross-service technical challenges and identify root causes rather than surface-level issues.</span></p></li><li><p><span><b><span>Architecture Knowledge: </span></b><span>Advanced understanding of system architecture, distributed systems, and performance optimization for highly available applications.</span></span></p></li><li><p><span><b><span>Modern Stack Experience:</span></b><span> High level of confidence with static site generators (Gatsby JS, Next JS), Node JS, and headless CMS platforms like Contentful.</span></span></p></li><li><p><span><b><span>Technical Expertise: </span></b><span>Deep proficiency in front-end technologies (HTML5, CSS3, TypeScript, JavaScript) and frameworks like React JS and TailwindCSS.</span></span></p></li><li><p><span><b><span>Standards &amp; Compliance:</span></b><span> Solid knowledge of WCAG accessibility standards, SEO best practices, and secure coding principles.</span></span></p></li><li><p><span><b><span>Tools of the Trade: </span></b><span>Proven experience with TDD, Gitflow, automated E2E testing, and cloud platforms (AWS, Azure, or GCP).</span></span></p></li><li><p><b><span>QA &amp; Automation Experience: </span></b><span>Familiarity with QA automation tools and processes strongly preferred.</span></p></li><li><p><b><span>Educational Background: </span></b><span>Bachelor's degree in Computer Science, Web Development, or a related field (or equivalent work experience).</span></p></li></ul><p></p><p></p><p></p><p></p><p><b><b>Be Human With Us:</b></b></p><p><span>Being human isn’t about checking every box on a list. It’s about the experiences we have, people we meet, and the perspectives we share. So, if you have the skills but are hesitant to apply because of your background, apply anyway. We need amazing people like you to help us challenge the conventional and think differently about the problems that we’re solving. We’re in this together. Come be human, with us.&nbsp;</span></p><p></p><p><b>What We Offer:</b><br>When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:</p><ul><li><p><b>Flextime, recognition, and support for autonomous work:</b> Flexible time off with ample learning and development opportunities to continue growing your career. We offer a comprehensive onboarding program, leadership training for Titans at all levels, and other programs and events. Great work is rewarded through Bonusly, peer-nominated awards, and more.</p></li><li><p><b>Holistic health and wellness benefits</b>: Company-paid medical, dental, and vision (with 100% employer paid options and 90% coverage for dependents), <span>FSA</span> and <span>HSA</span>, 401k match, and telehealth options including memberships to One Medical.</p></li><li><p><b>Support for Titans at all stages of life</b>: Parental leave and support, up to $20k in fertility services (i.e. <span>IUI</span> and <span>IVF</span>), surrogacy, and adoption reimbursement, on demand maternity support through Maven Maternity, free breast milk shipping through Maven Milk, pet insurance, legal advisory services, financial planning tools, and more.</p></li></ul><p></p><p><span>At ServiceTitan, we celebrate individuality and uniqueness. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We strongly encourage people from underrepresented groups to apply. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.</span></p><p></p>ServiceTitan is committed to fair and equitable compensation for all of our employees. We thoughtfully consider a wide range of factors when determining individual compensation.The expected salary range for this role for candidates residing in the United States is between $151,100 USD - $202,100 USD. Compensation for candidates residing outside the United States will vary by location and the specific salary range will be discussed during the hiring process. Actual compensation for an individual may vary depending on skills, performance over time, qualifications, experience, and location. In addition to the base salary, the total compensation package also includes an annual bonus, equity and a holistic suite of benefits.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/servicetitan-manager-web-development\">https://weworkremotely.com/remote-jobs/servicetitan-manager-web-development</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": {
      "min": 20000,
      "max": 20000
    },
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/codekeeper-full-stack-developer-javascript",
    "title": "Full Stack Developer (Javascript)",
    "company": "Codekeeper",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"http://codekeeper.co\">http://codekeeper.co</a>\n</p>\n\n<div class=\"col col-xs-7 description\">\n<p><span><strong>Full Stack Developer (JavaScript)</strong></span><br>Are you a talented Senior Full Stack JavaScript Developer with a passion for writing clean, efficient code? Ready to make a significant impact in the rapidly evolving software escrow industry?<br><br>Codekeeper is now accepting applications for a Full Stack Engineer specializing in JavaScript. Don't miss this opportunity to be part of our dynamic team!</p><h3><br><strong>About the Company</strong></h3><p>Codekeeper was founded by tech industry professionals to revolutionize software escrow for the cloud era. We offer state-of-the-art disaster recovery solutions that mitigate third-party risks in business operations. As a remote-first company with a central office in The Hague, we prioritize a healthy, resilient organization to support the development of our robust app.<br>🌐 <a href=\"https://codekeeper.co/\">codekeeper.co/</a></p><h3><br><strong>What Else Can You Expect from Us?</strong></h3><ul><li><p>A dynamic, enthusiastic, and fun team</p></li><li><p>Opportunities for growth within a startup environment</p></li><li><p>Regular team activities and get-togethers</p></li><li><p>A comprehensive onboarding process with a dedicated ramp-up period and time to learn</p></li><li><p>A culture that values open communication, feedback, and collaboration<br>We believe in nurturing our app, teams, and organization with a focus on long-term success. We're dedicated to building a healthy, resilient company that empowers every team, from design to support and operations.</p></li></ul><h3><br><strong>About You</strong></h3><p>You're a driven, \"getting things done\" kind of person who's eager to tackle new challenges and make a meaningful impact in the software escrow industry.</p><h3><br><strong>Skills &amp; Experience</strong></h3><ul><li><p>Degree in Computer Science</p></li><li><p>5+ years of hands-on experience in JavaScript, TypeScript, HTML5, CSS3, React/Context API</p></li><li><p>3+ years of experience with Next.js (App Router), GraphQL/Apollo</p></li><li><p>Proficiency with TailwindCSS</p></li><li><p>Proficiency in version control (Git, GitHub/GitLab)</p></li><li><p>Testing experience with Playwright, Cypress, or Jest + React Testing Library</p></li><li><p>Experience with relational databases like PostgreSQL and MySQL, as well as ORMs such as Prisma or Drizzle</p></li><li><p>Familiarity with authentication solutions (Cognito, Auth0, NextAuth.js)</p></li><li><p>Excellent communication skills, a team player, and service-oriented mindset</p></li><li><p>A strong passion for software development</p></li></ul><h3><br><strong>Nice to Have</strong></h3><ul><li><p>Knowledge of serverless functions &amp; edge computing (Vercel, AWS Lambda)</p></li><li><p>Understanding of CI/CD pipelines and DevOps (GitHub Actions, Vercel, Netlify)</p></li><li><p>Experience with data visualization frameworks (e.g., Chart.js, Google Charts)</p></li><li><p>Familiarity with AWS technologies</p></li></ul><h3><br><strong>Additional Info</strong></h3><ul><li><p><strong>Job Location:</strong> Remote (#LI-Remote)</p></li><li><p>Join us to shape the future of software escrow!</p></li></ul><h3><br><strong>How to Apply</strong></h3><p>Please send an application that speaks directly to how you would like to fill this position. There are no right answers or expectations. Show us your role in our company’s future and our role in yours. Address some of the work we do. Introduce yourself as a colleague. Feel free to respond in either Dutch or English.<br><strong>#LI-Remote</strong></p> </div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/codekeeper-full-stack-developer-javascript\">https://weworkremotely.com/remote-jobs/codekeeper-full-stack-developer-javascript</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-ai-ml-engineer-llm-systems-m-w-d",
    "title": "Ai/Ml Engineer – LLM Systems (M/W/D)",
    "company": "Anexia Internetdienstleistungs",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> \n    <br /><strong>URL:</strong> <a href=\"http://anexia.com\">http://anexia.com</a>\n</p>\n\n<div>Wir bei Anexia übernehmen jeden Tag Verantwortung für alle <b>Herausforderungen der digitalen Welt.</b> Denn wir verstehen uns als die <b>„Digital Transformation Engine“. </b>Wie uns das gelingt? Ganz einfach. Wir sind eine Familie von Möglichmacher:innen und Neu-Denker:innen. Wir können, wir wollen und wir dürfen auch. Und das macht uns einzigartig! Willst Du ein Teil unserer digitalen Revolution werden und mit uns gemeinsam Geschichte schreiben? <b>#joinourrevolution</b>\n<h1>AI/ML ENGINEER – LLM SYSTEMS (M/W/D)</h1>\n<p>Wien, Graz, Klagenfurt, Remote | Vollzeit</p>\n<p>Du begeisterst dich für künstliche Intelligenz und arbeitest gerne mit modernsten LLM-Technologien? Du arbeitest strukturiert und selbstständig und liebst es, intelligente Systeme zu entwickeln, die echten Mehrwert schaffen? Du bist ein kommunikativer Teamplayer, der innovative KI-Lösungen mit Leidenschaft umsetzt? Dann ist diese Position perfekt für dich!</p>\n<h2>#Profile</h2>\n                    &nbsp;\n                    <ul>\n<li>Du treibst die Entwicklung und den Einsatz von KI/ML-Systemen voran, mit besonderem Fokus auf Large Language Models (LLMs) und intelligente Agenten-Frameworks</li>\n<li>Du implementierst und betreibst <strong>LLM-Inferenz-Lösungen</strong> mit Runtimes wie Ollama, vLLM und TensorRT-LLM</li>\n<li>Du entwickelst <strong>agentische Anwendungen</strong> mit Frameworks wie Dify, LangFlow, Haystack, LlamaIndex, LangChain, LangGraph oder Pydantic AI</li>\n<li>Du <strong>integrierst KI-Funktionen</strong> von unterschiedlichen Anbietern (wie OpenAI, Anthropic, Groq und Cerebras) in Produktionssysteme</li>\n<li>Du implementierst <strong>LLMOps-Praktiken</strong> mit Tools wie LangFuse und LangSmith für Monitoring, Tracing und Observability</li>\n<li>Du <strong>entwickelst und optimierst ML-Pipelines</strong> mit Python, TensorFlow, PyTorch und scikit-learn für verschiedene KI-Anwendungen</li>\n<li>Du <strong>containerisierst und deployest KI-Anwendungen</strong> mit Docker und Podman</li>\n<li>Du arbeitest mit SQL-Datenbanken und implementierst Evaluierungs-Frameworks wie DeepEval zur Sicherstellung der Modellqualität</li>\n<li>Du arbeitest eng mit funktionsübergreifenden Teams zusammen und präsentierst und verbesserst kontinuierlich deine KI-Lösungen</li>\n</ul>\n<h2>#Wanted</h2>\n                    &nbsp;\n                    <ul>\n<li>Erfahrung mit RAG (Retrieval-Augmented Generation), Prompt Engineering oder Multi-Agenten-Systemen ist von großem Vorteil</li>\n<li>Fundiertes Verständnis von Large Language Models und Erfahrung mit dem HuggingFace-Ökosystem</li>\n<li>Praktische Erfahrung mit mindestens einem agentischen Framework (LangChain, LangGraph, Haystack, LlamaIndex, Dify, LangFlow oder Pydantic AI)</li>\n<li>Erfahrung mit Python und modernen ML-Frameworks (TensorFlow, PyTorch, scikit-learn)</li>\n<li>Kenntnisse in LLM-Inferenz-Runtimes wie Ollama, vLLM oder TensorRT-LLM</li>\n<li>Erfahrung mit LLM-APIs (OpenAI, Anthropic oder ähnliche Anbieter)</li>\n<li>Fundierte Kenntnisse in SQL und Datenbankoperationen</li>\n<li>Verständnis von LLMOps-Praktiken und Methoden zur Modellevaluierung</li>\n<li>Erfahrung mit Containerisierung (Docker/Podman) und Orchestrierungstools</li>\n<li>Erfahrung mit Versionskontrollsystemen und CI/CD-Tools von Vorteil</li>\n<li>Kenntnisse in DevOps-Praktiken (Ansible) sind ein Plus</li>\n<li>Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift</li>\n</ul>\n<h2>#REWARD</h2>\n            Anexia wurde als Familie groß und das soll auch in unserer Wachstumsstrategie so bleiben. Wir übernehmen gerne Verantwortung, respektieren einander und wir wissen, dass wir alles schaffen können. Wir schauen gut auf Anexia und Anexia schaut auch gut auf uns. Begeisterung, Erfahrung und Kompetenz zählen, daher kannst Du ein faires Gehalt und zahlreiche Benefits erwarten.<br>\n<h4>Gehaltsspanne</h4>\n<p>mind. 54.000€</p>\n<h4>Unsere Benefits</h4>\n                &nbsp;\n            Wir sind mehr als ein Arbeitsplatz. Daher bieten wir unseren Mitarbeiter:innen (teils abhängig von Deiner Position und Deinem Standort) viele Benefits: Gute Verkehrsanbindung, flexible Arbeitszeiten, Aus- und Weiterbildung, Mentoren-Programm, kostenlose Parkplätze, Arbeitshandy- und -notebook, Snacks und Getränke, Firmenwagen, Mitarbeiter:innen-Events, Fun-Corner, u.v.m.\n                #JOINOURREVOLUTION\n                <h2>#About</h2>\n            Anexia bietet hochwertige und individuelle Lösungen im Bereich Web- und Managed Hosting, sowie Individualsoftware- und App Entwicklung. Das 2006 gegründete Unternehmen mit Sitz in Klagenfurt und weiteren Standorten in Wien, Graz, Karlsruhe, Nürnberg und New York betreut zahlreiche internationale Kunden.\n                Über 350 Mitarbeiter:innen an mehr als 5 Bürostandorten in Österreich, Deutschland und den USA\n                Wir sind ISO-zertifiziert und haben seit Jahren eine „Sehr gute Bonität“.\n                Auf diese Qualität vertrauen Kunden wie Lufthansa, McDonalds, TeamViewer, u.v.m.\n                Über 350 Mitarbeiter:innen an mehr als 5 Bürostandorten in Österreich, Deutschland und den USA\n                Wir sind ISO-zertifiziert und haben seit Jahren eine „Sehr gute Bonität“.\n                Auf diese Qualität vertrauen Kunden wie Lufthansa, McDonalds, TeamViewer, u.v.m.\n                \n<h3>Du hast noch Fragen?</h3>\n<p>Daniela KOZÓ&nbsp; |&nbsp; Telefon: +43-50-556 &nbsp;|&nbsp; E-mail: career@anexia-it.com</p></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-ai-ml-engineer-llm-systems-m-w-d\">https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-ai-ml-engineer-llm-systems-m-w-d</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-data-engineer-m-w-d",
    "title": "Data Engineer (M/W/D)",
    "company": "Anexia Internetdienstleistungs",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Klagenfurt, 9020 Austria\n    <br /><strong>URL:</strong> <a href=\"http://anexia.com\">http://anexia.com</a>\n</p>\n\n<div>Wir bei Anexia übernehmen jeden Tag Verantwortung für alle <b>Herausforderungen der digitalen Welt.</b> Denn wir verstehen uns als die <b>„Digital Transformation Engine“. </b>Wie uns das gelingt? Ganz einfach. Wir sind eine Familie von Möglichmacher:innen und Neu-Denker:innen. Wir können, wir wollen und wir dürfen auch. Und das macht uns einzigartig! Willst Du ein Teil unserer digitalen Revolution werden und mit uns gemeinsam Geschichte schreiben? <b>#joinourrevolution</b>\n<h1>DATA ENGINEER (M/W/D)</h1>\n<p>Klagenfurt, Wien, Graz | Vollzeit</p>\n<p>Du arbeitest strukturiert und eigenverantwortlich und hast Freude daran Prozesse zu automatisieren? Du bist ein kommunikativer Teamplayer und bringst gerne eigene Ideen ein? Dann bist du bei uns in dieser Position genau richtig!</p>\n<h2>#Profile</h2>\n                    &nbsp;\n                    <ul>\n<li>Du treibst die Automatisierung unserer Prozesse voran, entwickelst ETL-/ELT-Pipelines und integrierst KI-gestützte Workflows</li>\n<li>Deine Aufgaben reichen von der Datenaufbereitung über die Modellierung von Datenbanken bis hin zur Implementierung&nbsp;und dem Deployment von Applikationen</li>\n<li>Du stehst in enger Abstimmung mit dem Management und hast Freude daran deine Lösungen zu präsentieren und laufend weiterzuentwickeln</li>\n</ul>\n<h2>#Wanted</h2>\n                    &nbsp;\n                    <ul>\n<li>Mehrjährige, fundierte Erfahrung mit Versionskontrollsystemen, CI/CD Tools,&nbsp;Orchestrierung und Containerization</li>\n<li>Mehrjährige Erfahrung mit Scriptsprachen wie Python</li>\n<li>Routinierter Umgang mit APIs, SQL und Datenbanken</li>\n<li>Erfahrungen mit Automatisierung von Prozessen und Modellierung von Datenbanken</li>\n<li>Verständnis des Zusammenspiels von Netzwerk, Server-Diensten und Betriebssystemen</li>\n<li>Praktische Erfahrung mit generativer KI, LLMs, RAG oder KI-Agenten von Vorteil</li>\n<li>Reisebereitschaft (regelmäßige Teamtreffen am Standort Klagenfurt)</li>\n<li>Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift</li>\n</ul>\n<h2>#REWARD</h2>\n            Anexia wurde als Familie groß und das soll auch in unserer Wachstumsstrategie so bleiben. Wir übernehmen gerne Verantwortung, respektieren einander und wir wissen, dass wir alles schaffen können. Wir schauen gut auf Anexia und Anexia schaut auch gut auf uns. Begeisterung, Erfahrung und Kompetenz zählen, daher kannst Du ein faires Gehalt und zahlreiche Benefits erwarten.<br>\n<h4>Gehaltsspanne</h4>\n<p>mind. 54.000€</p>\n<h4>Unsere Benefits</h4>\n                &nbsp;\n            Wir sind mehr als ein Arbeitsplatz. Daher bieten wir unseren Mitarbeiter:innen (teils abhängig von Deiner Position und Deinem Standort) viele Benefits: Gute Verkehrsanbindung, flexible Arbeitszeiten, Aus- und Weiterbildung, Mentoren-Programm, kostenlose Parkplätze, Arbeitshandy- und -notebook, Snacks und Getränke, Firmenwagen, Mitarbeiter:innen-Events, Fun-Corner, u.v.m.\n                #JOINOURREVOLUTION\n                <h2>#About</h2>\n            Anexia bietet hochwertige und individuelle Lösungen im Bereich Web- und Managed Hosting, sowie Individualsoftware- und App Entwicklung. Das 2006 gegründete Unternehmen mit Sitz in Klagenfurt und weiteren Standorten in Wien, Graz, Karlsruhe, Nürnberg und New York betreut zahlreiche internationale Kunden.\n                Über 350 Mitarbeiter:innen an mehr als 5 Bürostandorten in Österreich, Deutschland und den USA\n                Wir sind ISO-zertifiziert und haben seit Jahren eine „Sehr gute Bonität“.\n                Auf diese Qualität vertrauen Kunden wie Lufthansa, McDonalds, TeamViewer, u.v.m.\n                Über 350 Mitarbeiter:innen an mehr als 5 Bürostandorten in Österreich, Deutschland und den USA\n                Wir sind ISO-zertifiziert und haben seit Jahren eine „Sehr gute Bonität“.\n                Auf diese Qualität vertrauen Kunden wie Lufthansa, McDonalds, TeamViewer, u.v.m.\n                \n<h3>Du hast noch Fragen?</h3>\n<p>Daniela KOZÓ&nbsp; |&nbsp; Telefon: +43-50-556 &nbsp;|&nbsp; E-mail: career@anexia-it.com</p></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-data-engineer-m-w-d\">https://weworkremotely.com/remote-jobs/anexia-internetdienstleistungs-data-engineer-m-w-d</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/jetbrains-jetbrains-web-developer-advocate-developer-advocacy",
    "title": "JetBrains Web Developer Advocate (Developer Advocacy)",
    "company": "JetBrains",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3695/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Amsterdam, Netherlands; Belgrade, Serbia; Berlin, Germany; Limassol, Cyprus; Madrid, Spain; Munich, Germany; Paphos, Cyprus; Prague, Czech Republic; Remote, Germany; Warsaw, Poland; Yerevan, Armenia\n    <br /><strong>URL:</strong> <a href=\"http://jetbrains.com\">http://jetbrains.com</a>\n</p>\n\n<div class=\"job__description body\"><div><p>JetBrains makes industry-leading professional IDEs and team software. We are seeking a web developer advocate with deep knowledge in React.</p>\n<p>At JetBrains, our advocacy team’s mission is to make developers better. Candidates need to be self-starters: take initiative, plan tasks, coordinate across teams, and finish projects by themselves with light supervision.</p>\n<p>We need an advocate who can convincingly explain how our products can credibly enhance developer productivity in the web space and advise product teams based on industry trends and developer feedback. We are looking to hear from candidates who are experienced, passionate, empathetic, and ready to help with our roadmap.</p>\n<h1>In this role, you'll:</h1>\n<ul>\n<li>Grow relationships and our reputation in the industry within the global React community and on social networks.</li>\n<li>Attract attention to and explain various aspects of our product portfolio (through speaking, videos, blog posts, livestreams, sample code, etc.).</li>\n<li>Build and maintain relationships and a reputation in the industry with global and regional communities and on social networks.</li>\n<li>Provide feedback to the product teams.</li>\n<li>Meet with customers to listen to them and educate them about our offerings.</li>\n<li>Speak to the press on behalf of our products..</li>\n<li>Contribute as needed to other areas at JetBrains.</li>\n</ul>\n<h1>We’ll be happy to have you on our team if you have:</h1>\n<ul>\n<li>Applied experience with software engineering best practices: testing, refactoring, version control, etc.</li>\n<li>Strong React experience as well as practical experience with JavaScript, TypeScript, and related technologies.</li>\n<li>Fluency in both spoken and written English.</li>\n<li>Excellent communication skills, especially the ability to tell a compelling story about a technology.</li>\n<li>Self-organization, goal-setting, and time-management skills.</li>\n<li>Willingness to travel.</li>\n</ul>\n<h1>We’d be especially thrilled if you have:</h1>\n<ul>\n<li>Established reputation in the React developer community.</li>\n<li>Experience with JetBrains tools.</li>\n<li>Experience in developer advocacy.</li>\n<li>Proficiency in several programming languages (Python, Java, Kotlin, etc.).</li>\n<li>Background working in an environment with highly distributed, diverse teams.</li>\n<li>Portfolio of speaking engagements (conference recordings) and screencasts. Please submit it with your application.</li>\n</ul>\n<p><span>#LI-DNI</span></p></div><div><p><em>We process the data provided in your job application in accordance with the <a href=\"https://www.jetbrains.com/legal/docs/privacy/privacy-recruitment/\">Recruitment Privacy Policy.</a></em></p></div></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/jetbrains-jetbrains-web-developer-advocate-developer-advocacy\">https://weworkremotely.com/remote-jobs/jetbrains-jetbrains-web-developer-advocate-developer-advocacy</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/walter-senior-software-engineer",
    "title": "Senior Software Engineer",
    "company": "WALTER",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"http://gowalter.co\">http://gowalter.co</a>\n</p>\n\n\n<div>\n<p>Senior Software Engineers at Stamped are hands-on builders responsible for designing, developing, and delivering high-quality software that powers our products. This role combines technical depth with product intuition — engineers are expected to think like product partners, not just implementers.</p>\n<p>They work closely with Product and the Director of Engineering to rapidly prototype, validate, and scale solutions that drive measurable user value. Senior Engineers bring curiosity, empathy, and a bias for action, leveraging AI tools and modern practices to deliver with speed, reliability, and craftsmanship.</p>\n<p>This role has a strong emphasis on user-facing development — building intuitive, performant interfaces and components that merchants interact with daily. While full-stack capability is valued, you'll spend significant time on front-end architecture, UI implementation, and ensuring excellent user experiences across our product suite.</p>\n<p>Our current systems include a large .NET/C# foundation on the backend, so familiarity with these technologies is helpful for full-stack collaboration, but your primary focus will be o modern front-end development and the user experience layer.</p>\n<p>This group sits at the center of Stamped's shift toward an AI-native, iterative engineering culture — emphasizing autonomy, accountability, and shared ownership across the team.</p>\n<h3><strong>Responsibilities</strong></h3>\n<ul>\n<li><strong>Product Engineering:</strong>&nbsp;Design, build, test, and ship user-facing features with a focus on polish, performance, and usability.</li>\n<li><strong>Front-End Development:</strong>&nbsp;Build and maintain responsive, accessible UI components and interfaces using modern frameworks and tooling.</li>\n<li><strong>Prototyping &amp; Validation:</strong>&nbsp;Rapidly prototype new user experiences to validate value before scaling.</li>\n<li><strong>AI-Enabled Development:</strong>&nbsp;Use AI tools (e.g., Copilot, Claude, or similar) to accelerate development, reduce repetitive work, and improve code quality.</li>\n<li><strong>Technical Judgment</strong>: Participate in front-end architecture decisions, component design patterns, and client-side performance optimization. Contribute to discussions on full-stack integration and API design.</li>\n<li><strong>Execution &amp; Ownership:&nbsp;</strong>Deliver against roadmap commitments with a focus on quality, maintainability, and iteration — especially on user-facing surfaces.</li>\n<li><strong>Collaboration:</strong>&nbsp;Partner closely with Product and the Director of Engineering to align technical work with customer and business needs. Work alongside designers to ensure high-fidelity implementation of user experiences.</li>\n<li><strong>Knowledge Sharing:</strong>&nbsp;Document, mentor, and contribute to a culture of learning and openness.</li>\n<li><strong>Continuous Improvement:&nbsp;</strong>Stay curious and experimental with new tools, frameworks, and AI workflows that can improve speed, quality, or developer experience.</li>\n</ul>\n</div>\n\n\n<h2>Requirements</h2>\n<div>\n<ul>\n<li>5+ years of professional software engineering experience, with significant time spent on front-end or full-stack development</li>\n<li>Strong proficiency with modern JavaScript/TypeScript and front-end framework (React, Vue, or similar) — experience building scalable, maintainable component architectures</li>\n<li>Experience with responsive design, accessibility standards, and client-side performance optimization</li>\n<li>Familiarity with backend technologies and APIs — experience with C#/.NET, Node.js, Python, or similar is a plus for full-stack collaboration</li>\n<li>Experience with cloud infrastructure (AWS preferred)</li>\n<li>Demonstrated use of AI tools or automation in the development workflow</li>\n<li>Product mindset: comfort with ambiguity, iteration, and user-centric decision-making</li>\n<li>Excellent communication and collaboration skills; thrive in cross-functional teams</li>\n</ul>\n</div>\n\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/walter-senior-software-engineer\">https://weworkremotely.com/remote-jobs/walter-senior-software-engineer</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/madeo-web-developer-contract",
    "title": "Web Developer (Contract)",
    "company": "Madeo",
    "location": "Worldwide",
    "salary_raw": "",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0171/3685/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Brooklyn, NY\n    <br /><strong>URL:</strong> <a href=\"https://madeostudio.com/\">https://madeostudio.com/</a>\n</p>\n\n<p><strong>Contract Web Developer</strong></p>\n<p>&nbsp;</p>\n<p><strong>About the Role</strong></p>\n<p>We are inviting an experienced WordPress developer to join our team of 7 engineers. This is a remote contract role that may extend in time or with additional opportunities to join projects based on performance. Part-time and full-time availability will be considered. Please share more information with us about your experience and availability in the application.</p>\n<p><strong>Minimum Qualifications</strong></p>\n<p>Candidates need to meet the requirements below to be considered for the role:</p>\n<ul>\n<li>3+ years of demonstrated experience in web development</li>\n<li>Showcase of WordPress-developed websites, proven experience building custom</li>\n<li>Gutenberg blocks</li>\n<li>Strong proficiency in PHP, MySQL/MariaDB, JavaScript (ES6+)</li>\n<li>Working knowledge of RESTful APIs, authentication, and integration patterns</li>\n<li>Experience with Git-based workflows and modern development tools</li>\n<li>Demonstrated experience working within a remote team</li>\n<li>Agency experience working on multiple client projects in parallel</li>\n<li>Strong written and verbal English communication skills</li>\n</ul>\n<p><strong>Nice to Have Qualifications</strong></p>\n<ul>\n<li>Experience with Drupal 9/10 development, site configuration, and backend integrations with third-party platforms</li>\n</ul>\n<p><strong>Key tools and languages we currently use</strong></p>\n<ul>\n<li>Back-End: PHP 8+, MySQL/MariaDB, GraphQL, RestAPI, GitHub, WordPress Gutenberg blocks, WordPress Custom Themes and Plugins</li>\n<li>Front-End: Gulp.js, SCSS, Next.js, Bootstrap 5+, JavaScript, ES6+, GitHub</li>\n</ul>\n<p><strong>How to Apply </strong></p>\n<p>We invite you to learn more about our culture, projects, and approach, and to spend time with our featured case studies on our website. Please apply if you believe you are qualified for and interested in working on similar projects. Click the button below to complete the application and be considered for this role.</p>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/madeo-web-developer-contract\">https://weworkremotely.com/remote-jobs/madeo-web-developer-contract</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": null,
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  },
  {
    "url": "https://weworkremotely.com/remote-jobs/slidespeak-ai-software-engineer",
    "title": "AI Software Engineer",
    "company": "SlideSpeak",
    "location": "Worldwide",
    "salary_raw": "$50k-$60k",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0169/0797/logo.gif?ixlib=rails-4.0.0&w=50&h=50&dpr=2&fit=fill&auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> London, UK\n    <br /><strong>URL:</strong> <a href=\"https://slidespeak.co\">https://slidespeak.co</a>\n</p>\n\n<p>We're looking for a motivated Full Stack Software Engineer who wants to make a significant impact. As part of our small but growing team of 10, your work will directly influence the core product, enhancing our offering at a global scale. We're building out a one-of-a-kind AI-first presentation editor, so we hope you like working with 2D graphics.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Develop and optimize front-end UI with NextJS, React, and TypeScript</li>\n<li>Build and maintain backend services using Next, Python, FastAPI, and other frameworks</li>\n<li>Develop LLM and ML services to generate content for presentations (images, infographics, icons, content, ...)</li>\n<li>Collaborate on database management and query optimization</li>\n<li>Contribute to all phases of the development lifecycle, from design to deployment</li>\n</ul>\n<h2><strong>About you</strong></h2>\n<p>You are looking to grow rapidly in a insanely fast environment. You're eager to learn and contribute meaningfully to a product that's changing how millions of people create presentations.</p>\n<p>You move fast and can adapt quickly. We've entered a phase of growth where there is more work to do than there are people to do it - this means everyone on the team will be busy, but there are also countless opportunities to grow.</p>\n<p>You have a high quality bar for your work, even when moving quickly. As we scale our teams and customer base, the expectations of our software rises with it. We love engineers with a product sense that think of users and keep design and UX in mind.</p>\n<p>You're looking for teammates, not coworkers - folks you can learn from and grow with at SlideSpeak, and beyond.</p>\n<h2><strong>Skills and Qualifications</strong></h2>\n<ul>\n<li>Degree in Computer Science or relevant work experience</li>\n<li>Comfortable working with NextJS, React, TypeScript</li>\n<li>Some experience with Python or other backend frameworks and databases</li>\n<li>Some Familiarity with cloud services (AWS, GCP, Azure) and server management via shell</li>\n<li>Practical work experience, at a minimum through internships or personal projects</li>\n</ul>\n<h2><strong>Nice-to-Have</strong></h2>\n<ul>\n<li>Experience with Python backends, FastAPI, and RAG frameworks like LangChain, Llama Index</li>\n<li>Knowledge of vector databases and advanced database management systems</li>\n<li>Knowledge of 2D graphics editors and SVG (yep, it gets quite nitty gritty)</li>\n<li>Previous experience in fast-paced startup environments</li>\n</ul>\n<h2><strong>Tech Stack</strong></h2>\n<ul>\n<li>Frontend: NextJS, Zustand, Tailwind, Prisma</li>\n<li>Backend: Python, FastAPI, Llama Index</li>\n<li>Database: PostgreSQL, PGVector</li>\n<li>LLMs &amp; AI: Azure OpenAI, Google Gemini Flash, Replica</li>\n<li>DevOps: GitHub Actions, Checkly, Docker Compose, Azure, GCP, AWS</li>\n</ul>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li>Competitive salary: $50k-$60k based on experience</li>\n<li>Fully remote work environment with flexible scheduling</li>\n<li>Company-provided laptop and software budget tailored to your needs</li>\n<li>Budget for attending industry conferences (AI Engineer, Figma Config, WebSummit, etc.)</li>\n<li>Extraordinary quarterly fully-paid trips across Europe and globally, including accommodations and flights, to foster team bonding and creativity (our next trip is to Lisbon) </li>\n<li>WeWork membership</li>\n</ul>\n<h2><strong>Interview Process</strong></h2>\n<ol>\n<li>Initial Screening: 20-minutes, details on the role, questions to assess initial fit</li>\n<li>Skill Deep Dive: 45-minutes: In-depth assessment of your drivers, work ethic, and goals to determine mutual fit</li>\n<li>Technical Coding Challenge: Showcase your coding skills and problem-solving abilities with a case that we send before</li>\n<li>Cultural Fit with Founder/CEO (60 minutes)</li>\n</ol>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/slidespeak-ai-software-engineer\">https://weworkremotely.com/remote-jobs/slidespeak-ai-software-engineer</a></p>",
    "source": "We Work Remotely",
    "salary_normalized": {
      "min": 50000,
      "max": 60000
    },
    "created_at": "2026-02-27T02:40:25Z",
    "last_seen_at": "2026-02-27T02:47:55Z"
  }
]